[
    {
        "title": "Pierce Brosnan says he's heard his Black Adam character is \"going to have his own show, or his own movie\" and is \"going to be in the next Superman\"",
        "summary": "Pierce Brosnan is reportedly considering a return to comic book movies, following his DCEU debut in 'Black Adam', despite prior uncertainties regarding the franchise's future.",
        "url": "https://www.gamesradar.com/entertainment/dc-movies/pierce-brosnan-says-hes-heard-his-black-adam-character-is-going-to-have-his-own-show-or-his-own-movie-and-is-going-to-be-in-the-next-superman/",
        "category": "International"
    },
    {
        "title": "Betty Gilpin Joins Ron Howard’s Amazon MGM Military Drama ‘Alone At Dawn’",
        "summary": "Betty Gilpin has joined Adam Driver and Anne Hathaway in Ron Howard's upcoming Amazon MGM military drama, \"Alone at Dawn.\" The film is based on a 2019 book and is currently in development.",
        "url": "http://deadline.com/2025/11/alone-at-dawn-casts-betty-gilpin-amazon-mgm-1236620312/",
        "category": "Defence"
    },
    {
        "title": "Financial Firm GFI Group Expands to 129K SF at 55 Water Street",
        "summary": "Financial services firm GFI Group is significantly expanding its office presence in Manhattan's Financial District, doubling its footprint to a total of 128,749 square feet by adding an extra 64,993 square feet.",
        "url": "http://commercialobserver.com/2025/11/gfi-group-lease-expansion-55-water-street/",
        "category": "National"
    },
    {
        "title": "Yankees Predicted To Land Superstar Slugger With $360 Million Blockbuster",
        "summary": "Yankees principal owner Hal Steinbrenner spoke at a press conference at Yankee Stadium in Bronx, New York, on December 21, 2022.",
        "url": "https://www.forbes.com/sites/peterchawaga/2025/11/17/yankees-predicted-to-land-superstar-slugger-with-360-million-blockbuster/",
        "category": "National"
    },
    {
        "title": "Malayalam’s first action hero did over 100 films in 6 years; died performing dangerous stunt hanging from a helicopter",
        "summary": "The article delves into the origins and nature of Malayalam cinema, emphasizing its deep roots in the socio-political fabric of Kerala society and its consistent portrayal of stories centered around common people, reflecting the realities of the region.",
        "url": "https://indianexpress.com/article/entertainment/malayalam/jayan-did-over-100-films-in-6-years-died-performing-dangerous-stunt-hanging-from-a-helicopter-10370762/",
        "category": "National"
    },
    {
        "title": "Warren Beatty and Carrie Fisher, Then 17, Take a Break During Filming of the Movie “Shampoo” (1975)",
        "summary": "Shampoo is a 1975 American comedy film directed by Hal Ashby, starring Warren Beatty, Julie Christie, Goldie Hawn, Lee Grant, Jack Warden, Tony Bill, and Carrie Fisher.",
        "url": "https://www.vintag.es/2025/11/warren-beatty-carrie-fisher.html",
        "category": "National"
    },
    {
        "title": "Here’s Why Aristotle Atlantic’s Core Equity Strategy Sold Halliburton Company (HAL)",
        "summary": "Aristotle Atlantic Partners, an investment advisor, published its third-quarter 2025 investor letter, which includes a market review and quarterly performance update.",
        "url": "https://biztoc.com/x/df0c25e7e6e697b3",
        "category": "National"
    },
    {
        "title": "Paras Defence wins ₹71.68 cr DRDO order for submarine optronic periscopes",
        "summary": "Paras Defence and Space Technologies Ltd. has secured a 71.68-crore order from the Defence Research and Development Organisation (DRDO) for the supply of two Optronic Periscopes.",
        "url": "https://www.thehindubusinessline.com/economy/logistics/paras-defence-wins-7168-cr-drdo-order-for-submarine-optronic-periscopes/article70291009.ece",
        "category": "Defence"
    },
    {
        "title": "Here’s Why Aristotle Atlantic’s Core Equity Strategy Sold Halliburton Company (HAL)",
        "summary": "Aristotle Atlantic Partners, an investment advisor, released its Core Equity Strategy third-quarter 2025 investor letter, which included a market review and quarterly performance details.",
        "url": "https://finance.yahoo.com/news/why-aristotle-atlantic-core-equity-140820205.html",
        "category": "National"
    },
    {
        "title": "How India’s experience reflects on women’s evolving role in peacekeeping",
        "summary": "The Indian Army is planning to induct women soldiers into its Territorial Army (TA) battalions, a significant move aimed at expanding opportunities for women within the armed forces for the first time.",
        "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/how-indias-experience-reflects-on-womens-evolving-role-in-peacekeeping-10370983/",
        "category": "Defence"
    },
    {
        "title": "India-UK military exercise 'Ajeya Warrior-25' begins in Rajasthan",
        "summary": "The eighth edition of the India-UK joint military exercise 'Ajeya Warrior-25' has commenced at the Mahajan field firing ranges in Bikaner, Rajasthan. The exercise is conducted under a United Nations mandate.",
        "url": "https://economictimes.indiatimes.com/news/defence/india-uk-military-exercise-ajeya-warrior-25-begins-in-rajasthan/articleshow/125386609.cms",
        "category": "Defence"
    }
]