{
    "last_updated": "2025-11-19T01:12:38.649702+00:00",
    "articles": [
        {
            "title": "24k-Mile 2008 Lamborghini Murcielago LP640 Roadster",
            "summary": "This article details a modified 2008 Lamborghini Murciélago LP640 roadster, showcasing its Blu Monterey finish and Nero Perseus leather interior with blue stitching. Key enhancements include a rear-wheel-drive conversion, an LOC exhaust system, and distinct 19″ and 20″ wheels. This high-performance luxury vehicle highlights bespoke automotive engineering and customization, appealing to car enthusiasts and illustrating advanced vehicle modification trends.",
            "url": "https://bringatrailer.com/listing/2008-lamborghini-murcielago-lp640-roadster-8/",
            "category": "Sci & Tech",
            "date": "2025-11-18T01:00:15Z"
        },
        {
            "title": "Sailing-Normandy duo clinch Class 40 glory in thrilling finish",
            "summary": "Normandy sailors Guillaume Pirouelle and Cedric Chateau secured a dramatic victory in the Class 40 division of the Transat Cafe LOr Le Havre Normandie race on Monday. This win marked one of the closest finishes in the event's history, showcasing their exceptional seamanship across the transatlantic course. Their triumph highlights competitive international sailing achievements and the spirit of perseverance.",
            "url": "https://www.channelnewsasia.com/sport/sailing-normandy-duo-clinch-class-40-glory-in-thrilling-finish-5473466",
            "category": "International",
            "date": "2025-11-17T23:42:11Z"
        },
        {
            "title": "FireFly Metals announces Mineral Resource increased by 51% at Green Bay Copper Gold Project, Canada",
            "summary": "FireFly's submitted samples underwent rigorous internal and external Quality Assurance/Quality Control (QA/QC) protocols. These stringent procedures, involving certified reference materials and blank samples, ensure exceptional data integrity and reliability. This meticulous verification underscores FireFly's commitment to the highest analytical standards, vital for critical applications.",
            "url": "https://financialpost.com/globe-newswire/firefly-metals-announces-mineral-resource-increased-by-51-at-green-bay-copper-gold-project-canada",
            "category": "Sci & Tech",
            "date": "2025-11-17T23:32:27Z"
        },
        {
            "title": "FireFly Metals announces Mineral Resource increased by 51% at Green Bay Copper Gold Project, Canada",
            "summary": "An exceptional, high-grade mineral resource has been identified, showcasing significant copper equivalent (CuEq) deposits. The discovery includes 8.8 million tonnes at 3.9% CuEq in Measured & Indicated categories, alongside an additional 10.9 million tonnes at 3.8% CuEq in Inferred categories. This recently established resource holds substantial potential, representing a key finding in geological exploration and resource assessment.",
            "url": "https://www.globenewswire.com/news-release/2025/11/17/3189638/0/en/FireFly-Metals-announces-Mineral-Resource-increased-by-51-at-Green-Bay-Copper-Gold-Project-Canada.html",
            "category": "Sci & Tech",
            "date": "2025-11-17T23:30:00Z"
        },
        {
            "title": "Stream It Or Skip It: ‘One to One: John & Yoko’ on HBO Max, A Documentary About A 1970s Power Couple Giving Voice To Protest",
            "summary": "A new documentary, 'One to One: John & Yoko', directed by Oscar-winner Kevin MacDonald and Sam Rice-Edwards, with Sean Ono Lennon as executive producer, is now streaming on HBO Max. The film reconstructs key aspects of the iconic couple's lives, offering insights into their journey. This production brings a fresh perspective to their enduring legacy.",
            "url": "https://decider.com/2025/11/17/one-to-one-john-and-yoko-hbo-max-review/",
            "category": "International",
            "date": "2025-11-17T23:00:00Z"
        },
        {
            "title": "Fantasy Football 2025: Waiver wire, Week 12 edition",
            "summary": "This article provides Week 12 Fantasy Football waiver wire guidance, detailing an increased pool of available players due to recent injuries. It advises participants on making strategic player acquisitions to strengthen their virtual teams, highlighting opportunities for proactive management in the popular online sports game. The focus is purely on gameplay tactics and player selection for fantasy leagues.",
            "url": "https://www.bigblueview.com/new-york-giants-analysis/145509/fantasy-football-2025-waiver-wire-week-12-edition",
            "category": "National",
            "date": "2025-11-17T22:01:03Z"
        },
        {
            "title": "LS3-Powered 1958 Chevrolet Corvette",
            "summary": "A 1958 Chevrolet Corvette, acquired in 2021, is undergoing extensive recommissioning and customization at The Bowtie Shop in Billerica, Massachusetts. This classic vehicle is being meticulously restored and modified over a year-long process, reflecting a significant investment in automotive heritage and personalized design. Such projects highlight craftsmanship and the enduring appeal of vintage automobiles.",
            "url": "https://bringatrailer.com/listing/1958-chevrolet-corvette-139/",
            "category": "National",
            "date": "2025-11-17T21:44:24Z"
        },
        {
            "title": "Top U.S. admiral says he's watching China's rapid naval buildup closely",
            "summary": "A top U.S. admiral has called China's shipbuilding capability impressive, noting Beijing's rapid development of the world's largest navy. He underscored the critical importance of American cooperation with Asian allies to counter this expanding maritime influence. This highlights the intensifying strategic competition and naval power dynamics in the Indo-Pacific region.",
            "url": "https://japantoday.com/category/national/top-us-admiral-says-he%27s-watching-china%27s-rapid-naval-buildup-closely",
            "category": "Defence",
            "date": "2025-11-17T21:36:18Z"
        },
        {
            "title": "What are Titans WR options with Calvin Ridley hurt? Is it as bad for Cam Ward as it seems?",
            "summary": "The Tennessee Titans NFL team faces significant challenges with their wide receiver depth, which is at a multi-year low. This situation is worsened by key player Calvin Ridley being sidelined for the remainder of the season due to a broken fibula. The team will need to strategize to overcome these critical personnel losses and maintain competitive performance for the rest of the season.",
            "url": "https://www.tennessean.com/story/sports/nfl/titans/2025/11/17/chimere-dike-injury-calvin-ridley-elic-ayomanor-titans-cam-ward/87277945007/",
            "category": "National",
            "date": "2025-11-17T21:35:03Z"
        },
        {
            "title": "Cohesion, charging and chaos on the lunar surface",
            "summary": "Lunar dust poses a significant challenge, often described as a \"nightmare,\" for space exploration initiatives. Scientists are actively exploring various innovative methods to effectively deal with this pervasive issue, including advanced techniques like 3D printing. Addressing lunar dust is crucial for facilitating sustainable human presence, operations, and resource utilization on the Moon, proving vital for future lunar missions.",
            "url": "https://phys.org/news/2025-11-cohesion-chaos-lunar-surface.html",
            "category": "Sci & Tech",
            "date": "2025-11-17T21:08:00Z"
        },
        {
            "title": "How Trent Grisham’s $22 million decision could dramatically alter Yankees offseason plans",
            "summary": "The New York Yankees are grappling with critical roster decisions impacting their 2026 season. A major point of contention is whether player Trent Grisham will accept a lucrative $22.025 million one-year offer. This decision, currently beyond the team's control, will significantly influence the Yankees' future lineup and overall financial planning.",
            "url": "https://nypost.com/2025/11/17/sports/trent-grishams-22-million-decision-could-dramatically-alter-yankees-offseason/",
            "category": "National",
            "date": "2025-11-17T21:07:23Z"
        },
        {
            "title": "Joint Statement by UK and Italian Foreign and Defence Ministers",
            "summary": "UK and Italian Foreign and Defence Ministers held a virtual meeting, connecting HMS Prince of Wales in Naples with the Italian Defence Ministry in Rome. Foreign Ministers Yvette Cooper and Antonio Tajani, along with their defence counterparts, likely discussed strengthening bilateral defence cooperation and strategic partnership, highlighting ongoing diplomatic and military engagements between the two nations.",
            "url": "https://www.gov.uk/government/news/joint-statement-by-uk-and-italian-foreign-and-defence-ministers",
            "category": "Defence",
            "date": "2025-11-17T21:01:46Z"
        },
        {
            "title": "Fantasy Basketball Week 5 Start/Sit Lineup Decisions: Kris Dunn may be a sneaky gamble with upside",
            "summary": "The article reports on ongoing developments in the NBA, specifically focusing on a coaching change within the New Orleans Pelicans. Willie Green has been replaced by James Borrego, who takes over as the interim head coach. This highlights internal team management shifts amidst the professional basketball league's busy schedule, a common occurrence in top-tier sports.",
            "url": "https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-week-5-startsit-lineup-decisions/",
            "category": "National",
            "date": "2025-11-17T20:55:21Z"
        },
        {
            "title": "Putin aide visits India for maritime cooperation talks (PHOTOS)",
            "summary": "Russia has proposed significant maritime cooperation initiatives to India, including joint shipbuilding and repair clusters, as stated by senior Kremlin aide Nikolay Patrushev. These \"interesting initiatives\" aim to bolster strategic partnership, potentially enhancing India's naval capabilities and self-reliance in maritime defence. This move strengthens bilateral ties and holds crucial geopolitical implications for regional security, relevant for an SSB aspirant's strategic understanding.",
            "url": "https://www.rt.com/russia/627914-putin-aide-india-maritime-talks/",
            "category": "Defence",
            "date": "2025-11-17T20:38:05Z"
        },
        {
            "title": "NBA Communications: Other nominees... …",
            "summary": "NBA Communications has announced nominees for the Western Conference. Prominent players listed include Stephen Curry (GSW), Luka Dončić (LAL), Anthony Edwards (MIN), Shai Gilgeous-Alexander (OKC), and James Harden (LAC). These athletes are among the recognized nominees, according to the official communication, though the specific award or recognition remains unspecified in the brief report.",
            "url": "https://www.hoopshype.com/story/sports/nba/rumors/2025/11/17/nba-communications-other-nominees/87324520007/",
            "category": "National",
            "date": "2025-11-17T20:34:58Z"
        },
        {
            "title": "The US Air Force's new strategic bomber and ICBM got more money — almost $1 billion —in the government shutdown deal",
            "summary": "The advanced B-21 Raider stealth bomber is currently undergoing comprehensive flight testing at Edwards Air Force Base, California. These crucial trials encompass ground testing, taxiing maneuvers, and actual flying operations, signifying critical progress in the development and readiness of this next-generation long-range strike aircraft for the U.S. Air Force, enhancing future defence capabilities.",
            "url": "https://www.businessinsider.com/air-forces-new-bomber-icbm-got-more-money-shutdown-deal-2025-11",
            "category": "Defence",
            "date": "2025-11-17T19:59:28Z"
        },
        {
            "title": "Early NBA All-Star picks: How Team U.S. and Team World rosters could look",
            "summary": "The NBA season is well underway, proving to be highly entertaining with its usual blend of excitement. Key highlights include dominant team performances from teams like Oklahoma City, a fiercely contested MVP race featuring top stars, and the emergence of intriguing new rookie talents. The season is characterized by its dynamic and engaging nature, captivating fans globally.",
            "url": "https://sports.yahoo.com/nba/article/early-nba-all-star-picks-how-team-us-and-team-world-rosters-could-look-195455256.html",
            "category": "International",
            "date": "2025-11-17T19:54:55Z"
        },
        {
            "title": "Chandrayaan-4 mission likely to be launched in 2028, says Isro chief",
            "summary": "ISRO chief has indicated that India's ambitious Chandrayaan-4 lunar sample-return mission is projected for launch by 2028. This complex undertaking aims to retrieve lunar samples, signifying a major leap in India's space exploration capabilities. Such missions underscore the nation's scientific and technological advancement, contributing significantly to global space research and showcasing India's self-reliance in advanced space technologies.",
            "url": "https://timesofindia.indiatimes.com/india/chandrayaan-4-mission-likely-to-be-launched-in-2028-says-isro-chief/articleshow/125393792.cms",
            "category": "Sci & Tech",
            "date": "2025-11-17T19:04:44Z"
        },
        {
            "title": "The scary implications of the world’s first AI-orchestrated cyberattack",
            "summary": "A nuclear-armed intercontinental ballistic missile (ICBM) fired from Russia would reach the United States in approximately 30 minutes. Should such a missile be launched from a submarine, its arrival time could be even faster, significantly reducing reaction windows. This underscores the incredibly short warning periods and rapid escalation potential inherent in modern strategic nuclear warfare capabilities between major powers, demanding constant vigilance and robust defence readiness.",
            "url": "https://biztoc.com/x/7ccb6c845d9cf94b",
            "category": "Defence",
            "date": "2025-11-17T18:32:35Z"
        },
        {
            "title": "Fantasy Basketball Week 5 Start/Sit Lineup Decisions: Kris Dunn may be a sneaky gamble with upside",
            "summary": "The NBA schedule remains packed, with significant team changes unfolding. The New Orleans Pelicans have dismissed coach Willie Green, promoting James Borrego to interim head coach. This managerial shift underscores the high-stakes environment of professional sports, where strategic leadership adjustments are common amidst an ongoing season, influencing team dynamics and competitive outlook.",
            "url": "https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-week-5-startsit-lineup-decisions-kris-dunn-may-be-a-sneaky-gamble-with-upside/",
            "category": "International",
            "date": "2025-11-17T18:30:09Z"
        },
        {
            "title": "The scary implications of the world’s first AI-orchestrated cyberattack",
            "summary": "A nuclear-armed intercontinental ballistic missile (ICBM) launched from Russia would take roughly 30 minutes to reach the United States. Submarine-launched missiles could arrive even faster, posing significant challenges for early warning and strategic defense systems. This highlights ongoing concerns regarding nuclear deterrence, response times, and the complexities of international security dynamics.",
            "url": "https://www.vox.com/politics/468720/nuclear-ai-command-control",
            "category": "Defence",
            "date": "2025-11-17T18:23:51Z"
        },
        {
            "title": "Introducing F# 10",
            "summary": "F# 10 has officially shipped alongside .NET 10 and Visual Studio 2026. This latest iteration is a refinement release, prioritizing clarity, consistency, and enhanced performance. It introduces a series of small but meaningful improvements designed to optimize the F# programming language, making it more efficient and user-friendly for developers working with the new Microsoft development stack.",
            "url": "https://devblogs.microsoft.com/dotnet/introducing-fsharp-10/",
            "category": "Sci & Tech",
            "date": "2025-11-17T18:05:00Z"
        },
        {
            "title": "Ringo Starr announces spring 2026 tour. Get tickets today",
            "summary": "Vivid Seats has officially partnered with the New York Post as its exclusive ticketing provider. This commercial collaboration aims to generate revenue for the Post through content sharing and direct user purchases. Aspiring customers should note that all featured pricing related to this partnership is subject to change, reflecting a business strategy for media outlets to diversify income streams.",
            "url": "https://nypost.com/2025/11/17/ticket-sales/ringo-starr-tour-2026-where-to-buy-tickets-schedule-dates/",
            "category": "International",
            "date": "2025-11-17T18:03:32Z"
        },
        {
            "title": "Inside billionaire Gabe Newell’s new $500 million superyacht, which has a submarine garage and its own hospital",
            "summary": "Gabe Newell's company Valve, creator of the popular Steam PC gaming platform, recently announced three significant new hardware products last Wednesday. This marks a major development for Valve, expanding its presence beyond software into the hardware market. These announcements are crucial for PC gamers and tech enthusiasts, promising new innovations for the gaming community.",
            "url": "https://biztoc.com/x/c7b967b335c7477d",
            "category": "Sci & Tech",
            "date": "2025-11-17T17:36:24Z"
        },
        {
            "title": "Pierce Brosnan says he's heard his Black Adam character is \"going to have his own show, or his own movie\" and is \"going to be in the next Superman\"",
            "summary": "Pierce Brosnan, known for his diverse roles, including James Bond, is reportedly considering a return to comic book movies. He previously debuted in the DCEU's \"Black Adam\" in 2022. However, the future of DC cinematic projects became uncertain following a leadership change with James Gunn and Peter Safran. This news suggests potential new opportunities for Brosnan within the evolving superhero genre.",
            "url": "https://www.gamesradar.com/entertainment/dc-movies/pierce-brosnan-says-hes-heard-his-black-adam-character-is-going-to-have-his-own-show-or-his-own-movie-and-is-going-to-be-in-the-next-superman/",
            "category": "International",
            "date": "2025-11-17T17:27:17Z"
        },
        {
            "title": "Inside billionaire Gabe Newell’s new $500 million superyacht, which has a submarine garage and its own hospital",
            "summary": "Gabe Newell, Valve's co-founder, purchased Oceanco, a Dutch shipyard, in August for an undisclosed sum. This acquisition followed Newell's close collaboration with the company on designing and building his luxury yacht, 'Leviathan'. This move highlights a prominent tech entrepreneur's direct investment in specialized international manufacturing, securing control over high-end maritime asset creation rather than relying solely on external contractors.",
            "url": "https://fortune.com/2025/11/17/gabe-newell-leviathan-superyacht-features-submarine-garage-hospital-spa-gaming-pcs-inkfish-oceanco/",
            "category": "International",
            "date": "2025-11-17T17:19:40Z"
        },
        {
            "title": "Betty Gilpin Joins Ron Howard’s Amazon MGM Military Drama ‘Alone At Dawn’",
            "summary": "Actress Betty Gilpin joins Adam Driver and Anne Hathaway in Ron Howard's upcoming Amazon MGM military drama, \"Alone at Dawn.\" Based on a 2019 book, this film promises an in-depth exploration of military themes. For SSB aspirants, such productions offer cinematic perspectives on defence life and operations, enhancing general awareness about the armed forces' portrayal in popular culture and potential discussion points.",
            "url": "http://deadline.com/2025/11/alone-at-dawn-casts-betty-gilpin-amazon-mgm-1236620312/",
            "category": "Defence",
            "date": "2025-11-17T17:15:55Z"
        },
        {
            "title": "DA Alvin Bragg Releases Migrant Taxi Driver Charged for Repeatedly Assaulting Female Passengers",
            "summary": "District Attorney Alvin Bragg has released a migrant taxi driver who was reportedly charged with repeatedly assaulting female passengers. This controversial decision, according to Breitbart, sparks debate regarding public safety and accountability for serious offenses. The release, despite allegations of multiple assaults, raises concerns about the justice system's handling of such cases involving vulnerable victims and individuals with a history of charges.",
            "url": "https://freerepublic.com/focus/f-news/4353009/posts",
            "category": "National",
            "date": "2025-11-17T17:15:26Z"
        },
        {
            "title": "Financial Firm GFI Group Expands to 129K SF at 55 Water Street",
            "summary": "GFI Group, a financial services firm, is significantly expanding its presence in Manhattan's Financial District by doubling its office footprint. The company has added an additional 64,993 square feet on the 11th floor, bringing its total space to 128,749 square feet. This expansion signifies the firm's growth and continued investment in a prime financial hub within the US.",
            "url": "http://commercialobserver.com/2025/11/gfi-group-lease-expansion-55-water-street/",
            "category": "National",
            "date": "2025-11-17T15:58:43Z"
        },
        {
            "title": "The US Military Just Launched An Unarmed Nuclear Missile - Here's Why",
            "summary": "A recent test flight successfully launched an unarmed missile from California, traversing a specified flight path. This exercise mirrored a previous test in May, maintaining a consistent schedule and pattern for evaluating missile capabilities. Such recurring tests are crucial for assessing technological readiness and reinforcing national defense strategies, demonstrating ongoing advancements in missile technology.",
            "url": "https://www.bgr.com/2023446/why-us-military-launched-unarmed-nuclear-missile-vandenberg/",
            "category": "Defence",
            "date": "2025-11-17T15:47:00Z"
        },
        {
            "title": "GA-ASI and Saab Will Test MQ-9B AEW&C Variant in the Summer of 2026",
            "summary": "General Atomics Aeronautical Systems (GA-ASI) plans to test a new podded Airborne Early Warning and Control (AEW&C) capability for its MQ-9B Remotely Piloted Aircraft (RPA). This enhancement significantly boosts the MQ-9B's versatility as an airborne surveillance platform. For SSB aspirants, it underscores advancements in unmanned aerial vehicle (UAV) technology, vital for modern intelligence gathering and battlefield awareness in defence, reflecting evolving aerial warfare strategies.",
            "url": "https://theaviationist.com/2025/11/17/mq-9b-aewc-test-summer-2026/",
            "category": "Defence",
            "date": "2025-11-17T15:31:35Z"
        },
        {
            "title": "Abraxas Power Corp. Granted Environmental Permit and Commences Coastal Works and Land Reclamation for Project Solar City, the First SEZ Development in the Maldives",
            "summary": "Abraxas Power Corp. has commenced work on its 100 MW floating-solar project after receiving environmental approval. The company is initiating land reclamation activities, marking a significant step towards developing this large-scale renewable energy infrastructure. This project leverages innovative floating solar technology, aiming to contribute substantially to clean power generation. Its progression highlights advancements in sustainable energy solutions and project implementation.",
            "url": "https://financialpost.com/globe-newswire/abraxas-power-corp-granted-environmental-permit-and-commences-coastal-works-and-land-reclamation-for-project-solar-city-the-first-sez-development-in-the-maldives",
            "category": "Sci & Tech",
            "date": "2025-11-17T15:17:04Z"
        }
    ]
}