{
    "last_updated": "2025-11-20T18:23:27.457269+00:00",
    "articles": [
        {
            "title": "China masterminded Rafale disinfo campaign: US report",
            "summary": "China initiated an extensive disinformation campaign to discredit India's Rafale fighter jets. This elaborate effort leveraged fake news, dubious social media handles, and AI-generated images, specifically targeting the advanced aircraft after India began utilizing them. The campaign highlights a concerning trend of information warfare aimed at undermining defence capabilities and international procurement decisions.",
            "url": "https://economictimes.indiatimes.com/news/defence/china-masterminded-rafale-disinfo-campaign-us-report/articleshow/125444802.cms",
            "category": "Defence",
            "date": "2025-11-19T18:21:25Z"
        },
        {
            "title": "Delhi blast case: Trouble mounts for Al Falah University Chairman Siddiqui as ED steps in",
            "summary": "The Enforcement Directorate (ED) is reportedly preparing to share its investigation findings concerning Al Falah group chairman Jawad Siddiqui with Delhi Police. This move is expected to prompt the Delhi Police to register a fresh First Information Report (FIR) against Siddiqui, indicating escalating legal trouble for the chairman. The developments are unfolding in New Delhi.",
            "url": "https://economictimes.indiatimes.com/news/india/delhi-blast-case-trouble-mounts-for-al-falah-university-chairman-siddiqui-as-ed-steps-in/articleshow/125444790.cms",
            "category": "National",
            "date": "2025-11-19T18:21:09Z"
        },
        {
            "title": "Noise-Induced Hearing Loss Enhances Ca2+-Dependent Electrical Activity in Lateral Cochlear Efferents",
            "summary": "Loud and prolonged noise exposure significantly damages the cochlea, the inner ear structure, subsequently triggering adverse changes in the brain's processing. This leads to profound hearing loss and a diminished capacity for speech comprehension. The precise mechanisms or further long-term effects of such noise exposure beyond these initial findings remain subjects of ongoing scientific investigation.",
            "url": "https://www.jneurosci.org/content/45/47/e0850252025",
            "category": "Sci & Tech",
            "date": "2025-11-19T17:30:30Z"
        },
        {
            "title": "Fisch boats guide",
            "summary": "This Roblox game encourages players to experiment with various 'Fisch boats' and vehicles, like 'Santa's Jetski,' emphasizing that personal preference for specific in-game items contributes more to enjoyment than simply choosing top-tier options. The core fun derives from players discovering what works best for their individual playstyle, promoting a free-spirited approach to gameplay within the virtual environment.",
            "url": "https://www.pockettactics.com/fisch-boats",
            "category": "Sci & Tech",
            "date": "2025-11-19T17:22:16Z"
        },
        {
            "title": "Can You Keep a Secret? BBC Previews Dawn French, Mandip Gill Comedy",
            "summary": "The BBC has previewed its new sitcom, 'Can You Keep a Secret?', starring Dawn French and Mandip Gill. This upcoming series aims to tackle a unique blend of significant human experiences and everyday realities. It will explore themes of love, death, and surprisingly, insurance, promising a distinctive narrative approach for viewers to engage with through its premise.",
            "url": "https://bleedingcool.com/tv/can-you-keep-a-secret-bbc-previews-dawn-french-mandip-gill-comedy/",
            "category": "National",
            "date": "2025-11-19T17:07:03Z"
        },
        {
            "title": "Astronaut Group Captains pitch for India's global leadership in space at International Space Conclave",
            "summary": "Indian astronaut designates Group Captains P B Nair and Angad Pratap advocate for India to play a defining role in global space governance. They stressed India's need to shape future space norms, leveraging its advanced capabilities and strategic initiatives like Gaganyaan. This highlights India's rising influence and proactive approach in a critical domain, aligning with national security and technological ambitions.",
            "url": "https://economictimes.indiatimes.com/news/science/astronaut-group-captains-designate-pitch-for-indias-global-leadership-in-space-at-international-space-conclave/articleshow/125442231.cms",
            "category": "Sci & Tech",
            "date": "2025-11-19T16:46:37Z"
        },
        {
            "title": "Yankees fan loses his mind in wild WFAN call after Trent Grisham’s crucial decision",
            "summary": "Trent Grisham's return to the Yankees has ignited significant fan discontent, ranging from upset to outright outrage among supporters. This strong negative reaction was notably highlighted when a fan called into WFAN on Tuesday evening, articulating numerous grievances concerning the player's comeback to the team.",
            "url": "https://nypost.com/2025/11/19/sports/furious-yankees-fan-goes-on-radio-rant-after-trent-grisham-return/",
            "category": "National",
            "date": "2025-11-19T16:38:46Z"
        },
        {
            "title": "SABR Historian Puts GuardiansGate Into Historical Perspective Vs. Black Sox, Rose",
            "summary": "Sports gambling scandals have been a recurrent issue in the United States, affecting virtually every sport and league. Organizations have consistently grappled with rooting out and overcoming various forms of corruption, highlighting a persistent struggle to maintain integrity across American professional sports, an ongoing challenge for domestic sports governance.",
            "url": "https://www.ingame.com/sabr-clase-rose-black-sox/",
            "category": "National",
            "date": "2025-11-19T15:25:28Z"
        },
        {
            "title": "The legendary Slappie",
            "summary": "In the 1850s, thousands of immigrants from the Bohemia region of Czechoslovakia settled in Cedar Rapids, Iowa. These new arrivals predominantly established communities in neighborhoods southeast of the downtown area, contributing significantly to the city's demographic and cultural development. This historical migration exemplifies the diverse origins shaping American society.",
            "url": "https://www.royalsreview.com/general/90159/the-legendary-slappie",
            "category": "National",
            "date": "2025-11-19T15:00:00Z"
        },
        {
            "title": "Torngat Metals rare earth project poses radiation risks, says activist",
            "summary": "Canada's accelerating pursuit of rare earth elements (REEs) is raising environmental concerns. A Nova Scotia activist warns of significant ecological risks associated with rare earth mining, particularly when deposits are located near sensitive areas. This highlights the growing global dilemma of balancing resource extraction for critical technologies with environmental protection, a crucial consideration for national development and strategic autonomy.",
            "url": "https://www.cbc.ca/news/canada/newfoundland-labrador/strange-lake-environmental-risk-9.6982718",
            "category": "Sci & Tech",
            "date": "2025-11-19T14:40:12Z"
        },
        {
            "title": "Dynamic patterns of gene expression match extracellular signals through push-pull regulation",
            "summary": "A study by Montano-Gutierrez et al. (2025) unveils how dynamic patterns of gene expression precisely match extracellular signals. The research, published in PLoS Genetics, highlights a 'push-pull regulation' mechanism, explaining how cells finely tune their genetic activity in response to environmental cues. This fundamental discovery enhances our understanding of cellular communication and biological regulation, vital for various life processes.",
            "url": "https://journals.plos.org/plosgenetics/article?id=10.1371/journal.pgen.1011943",
            "category": "Sci & Tech",
            "date": "2025-11-19T14:00:00Z"
        },
        {
            "title": "ISRO successfully tests boot-strap mode start on CE20 cryogenic engine",
            "summary": "ISRO successfully demonstrated the boot-strap mode start test of its CE20 Cryogenic engine, which powers the upper stage of launch vehicles. This significant milestone showcases India's indigenous capabilities in advanced cryogenic engine technology. The successful test enhances the reliability and operational efficiency of future space missions, reinforcing ISRO's prowess in global space exploration.",
            "url": "https://economictimes.indiatimes.com/news/science/isro-successfully-tests-boot-strap-mode-start-on-ce20-cryogenic-engine/articleshow/125439399.cms",
            "category": "Sci & Tech",
            "date": "2025-11-19T13:53:06Z"
        },
        {
            "title": "How Trump could still keep Epstein files secret, despite House and Senate votes",
            "summary": "Reports suggest former President Trump might still possess legal avenues to keep Jeffrey Epstein's files confidential, despite legislative votes by the House and Senate for their release. This situation involves potential executive actions or legal strategies to bypass congressional mandates, highlighting the ongoing complexities surrounding the high-profile case and the push for transparency in national politics.",
            "url": "https://freerepublic.com/focus/f-news/4353358/posts",
            "category": "National",
            "date": "2025-11-19T13:51:04Z"
        },
        {
            "title": "India’s first commercial PSLV rocket set to launch Oceansat satellite early next year",
            "summary": "India's first commercially built PSLV rocket, developed by a consortium including L&T and Hindustan Aeronautics Ltd, is set to launch the Oceansat satellite early next year. This marks a crucial step in commercializing India's space launch sector, with private industry playing a lead role in producing rockets for ISRO missions, bolstering national capabilities and self-reliance in space technology.",
            "url": "https://www.thehindubusinessline.com/news/science/indias-first-commercial-pslv-rocket-set-to-launch-oceansat-satellite-early-next-year/article70299274.ece",
            "category": "Sci & Tech",
            "date": "2025-11-19T13:41:35Z"
        },
        {
            "title": "Senator Scott Wiener’s Legislation Protects Sex Offenders Who Have Homosexual Sex with Minors",
            "summary": "A report from California Globe alleges that Senator Scott Wiener's legislation in California offers protections for sex offenders involved in homosexual acts with minors. The article, dated November 18, 2025, from Katy Grimes, highlights a highly controversial aspect of proposed lawmaking. This claim has generated significant public debate regarding legal protections and child safety.",
            "url": "https://freerepublic.com/focus/f-news/4353356/posts",
            "category": "National",
            "date": "2025-11-19T13:39:46Z"
        },
        {
            "title": "Eli Lilly wants to be part of making a big dent in obesity and diabetes, says co's India head Winselow Tucker",
            "summary": "A comprehensive strategy aims to significantly impact the health challenges posed by obesity and type 2 diabetes. This approach involves developing high-quality products, fostering strategic partnerships within the healthcare ecosystem, and prioritizing patient education. By integrating these key elements, the initiative seeks to effectively manage and reduce the prevalence of these widespread conditions, ultimately contributing to improved public health outcomes through innovative solutions and collaborative efforts.",
            "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/eli-lilly-wants-to-be-part-of-making-a-big-dent-in-obesity-and-diabetes-says-cos-india-head-winselow-tucker/articleshow/125438892.cms",
            "category": "Sci & Tech",
            "date": "2025-11-19T13:35:42Z"
        },
        {
            "title": "Indian Army secures intellectual property rights for new coat combat (digital print)",
            "summary": "The Indian Army has secured Intellectual Property Rights (IPR) for its new \"Coat Combat (Digital Print),\" a three-layered garment integrating advanced combat functionality with enhanced comfort and protection for soldiers. This indigenous development underscores the Army's commitment to modernizing soldier gear and promoting self-reliance in defence technology, ensuring better operational effectiveness and security for personnel.",
            "url": "https://economictimes.indiatimes.com/news/defence/indian-army-secures-intellectual-property-rights-for-new-coat-combat-digital-print/articleshow/125438961.cms",
            "category": "Defence",
            "date": "2025-11-19T13:29:34Z"
        },
        {
            "title": "HAL, Hensoldt ink deal for helicopter obstacle-avoidance tech",
            "summary": "An EMI calculator is a vital financial tool enabling individuals, including aspiring defense personnel, to determine the exact monthly installment for various loans like home, car, or personal. Understanding EMIs is crucial for effective personal financial planning and managing budgets responsibly. This tool ensures aspirants are well-prepared for future financial commitments, promoting sound financial literacy essential for life in the services.",
            "url": "https://timesofindia.indiatimes.com/business/india-business/hal-hensoldt-ink-deal-for-helicopter-obstacle-avoidance-tech/articleshow/125438446.cms",
            "category": "Sci & Tech",
            "date": "2025-11-19T13:14:12Z"
        },
        {
            "title": "Kirby Air Riders Reviews Are Mostly Happy With The Pink Blob’s Racing Return",
            "summary": "Nintendo GameCube's 2003 racing title, Kirby Air Ride, developed by HAL Laboratory and led by Super Smash Bros. creator Masahiro Sakurai, has significantly grown in players' esteem retrospectively. Initially launched with moderate success, the game has since garnered a stronger, more positive reception in people's memories, far exceeding its original popularity and becoming a cherished classic for many.",
            "url": "https://kotaku.com/kirby-air-riders-reviews-nintendo-switch-2-2000645412",
            "category": "Sci & Tech",
            "date": "2025-11-19T13:00:48Z"
        },
        {
            "title": "NBA Power Rankings: Who provides the most stealth help for all 30 teams?",
            "summary": "The 2025-26 NBA regular season has commenced, marked by a varied start featuring early All-Star performances alongside disappointing team beginnings. Prominently, star player Nikola Jokic is reportedly continuing his historic run, highlighting the season's dynamic nature. The league anticipates an interesting season ahead, with numerous storylines expected to unfold as teams navigate their performances.",
            "url": "https://www.espn.com/nba/story/_/id/47013116/nba-power-rankings-all-30-teams-rank-important-bench-role-player",
            "category": "National",
            "date": "2025-11-19T12:36:24Z"
        },
        {
            "title": "At least nine killed, dozens injured in Russian attacks across Ukraine",
            "summary": "Ukrainian President Zelenskyy reported at least nine people killed and dozens wounded in widespread Russian drone and missile attacks across Ukraine overnight. These ongoing military assaults underscore the severe human cost and persistent conflict in the region, emphasizing the volatile international security landscape and the critical importance of defence awareness for aspiring officers.",
            "url": "https://www.aljazeera.com/news/2025/11/19/children-among-the-36-wounded-in-russias-overnight-attacks-on-ukraine",
            "category": "Defence",
            "date": "2025-11-19T09:15:14Z"
        },
        {
            "title": "Dyson Black Friday & Cyber Monday Deals: Beauty, Floor Cleaning and Air Purifier",
            "summary": "Dyson is launching Black Friday and Cyber Monday sales in the UAE, running from November 3 to December 7, 2025. The promotions cover its range of beauty, floor care, and environmental care products. This initiative aims to boost sales during the festive shopping season, offering deals on popular consumer electronics to customers in the region, reflecting consumer market trends.",
            "url": "https://me.pcmag.com/en/appliances/33547/dyson-black-friday-cyber-monday-deals-beauty-floor-cleaning-and-air-purifier",
            "category": "Sci & Tech",
            "date": "2025-11-19T09:05:37Z"
        },
        {
            "title": "WIAA Division 5 state championship features undefeated teams, Mayville and Northwestern",
            "summary": "The Mayville football team's seniors are poised for a significant state championship rematch against Aquinas. After suffering a 22-14 defeat to Aquinas as freshmen, this determined group now has a critical opportunity for redemption. This narrative emphasizes perseverance and the pursuit of a second chance, reflecting the resilience and leadership qualities vital for SSB aspirants facing challenges.",
            "url": "https://www.thenorthwestern.com/story/sports/high-school/football/2025/11/19/mayville-football-to-compete-for-wiaa-d4-title/87326226007/",
            "category": "National",
            "date": "2025-11-19T09:01:11Z"
        },
        {
            "title": "Romania scrambles jets over fresh drone incursion",
            "summary": "NATO member Romania, bordering Ukraine, scrambled fighter jets after a fresh drone incursion into its territory. This incident, part of repeated violations, highlights the significant security challenges faced by frontline NATO states due to the ongoing conflict in Ukraine. It underscores the continuous need for airspace vigilance and defence readiness in the region, a critical aspect for national security.",
            "url": "https://www.euractiv.com/news/romania-scrambles-jets-over-fresh-drone-incursion/",
            "category": "Defence",
            "date": "2025-11-19T09:00:11Z"
        },
        {
            "title": "Romania scrambles fighter jets after drone incursion",
            "summary": "Romania, a NATO member, scrambled fighter jets after a drone breached its airspace during a Russian attack on Ukrainian infrastructure near their shared border. The Romanian defence ministry confirmed the incident, highlighting ongoing tensions and potential spillover risks from the conflict, particularly for countries bordering the war zone. This event underscores the vigilance required by NATO allies.",
            "url": "https://www.rte.ie/news/world/2025/1119/1544712-romania-drones/",
            "category": "International",
            "date": "2025-11-19T07:40:58Z"
        },
        {
            "title": "Air India lobbies to use airspace over China's Xinjiang as financial woes mount",
            "summary": "Air India is urging the Indian government to negotiate with China for access to sensitive military airspace in Xinjiang. This initiative aims to shorten flight routes and alleviate significant financial losses faced by Indian carriers due to existing airspace restrictions, likely impacting routes over Pakistan. The situation underscores the economic and strategic importance of international airspace access and the role of diplomatic efforts.",
            "url": "https://www.thehindubusinessline.com/economy/logistics/air-india-lobbies-to-use-airspace-over-chinas-xinjiang-as-financial-woes-mount/article70297776.ece",
            "category": "International",
            "date": "2025-11-19T06:23:36Z"
        },
        {
            "title": "INDIA-UK JOINT MILITARY TRAINING EXERCISE 'AJEYA WARRIOR-25' COMMENCES IN RAJASTHAN",
            "summary": "The eighth edition of the India-UK Joint Military Exercise \"AJEYA WARRIOR-25\" commenced today, underscoring robust bilateral defence cooperation. This annual exercise is vital for enhancing interoperability, sharing best practices, and strengthening strategic ties between the armed forces of both nations. For SSB aspirants, such joint drills highlight the importance of international military partnerships and collective security efforts.",
            "url": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-251117-india-pib02.htm",
            "category": "Defence",
            "date": "2025-11-19T05:55:58Z"
        },
        {
            "title": "CURTAIN RAISER OF CHANAKYA DEFENCE DIALOGUE 2025 HELD IN NEW DELHI",
            "summary": "The Ministry of Defence reported the Indian Army, in collaboration with the Centre for Land Warfare Studies (CLAWS), conducted an event. This partnership highlights crucial synergy between India's armed forces and strategic think tanks. While specific details of the initiative are not provided, such joint efforts are vital for enhancing military doctrine, fostering innovative defence strategies, and strengthening operational preparedness among officers.",
            "url": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-251117-india-pib03.htm",
            "category": "Defence",
            "date": "2025-11-19T05:55:16Z"
        },
        {
            "title": "Global risk-off sentiment keeping Indian markets in sluggish mode: Dharmesh Kant",
            "summary": "Indian markets are cautiously trading due to a global 'risk-off' sentiment, originating from corrections in US equities. This trend is impacting assets like Bitcoin and precious metals internationally. Understanding such interconnected global financial movements is crucial for comprehending broader international economic stability and India's position within it, vital for SSB aspirants.",
            "url": "https://economictimes.indiatimes.com/markets/expert-view/global-risk-off-sentiment-keeping-indian-markets-in-sluggish-mode-dharmesh-kant/articleshow/125427233.cms",
            "category": "International",
            "date": "2025-11-19T04:48:47Z"
        },
        {
            "title": "Air India lobbies to use airspace over China's Xinjiang as financial woes mount",
            "summary": "Air India is urging the Indian government to negotiate with China for permission to use a sensitive military airspace zone in Xinjiang. This aims to significantly shorten flight routes and reduce the substantial financial burden on the airline. Current restrictions necessitate longer, costlier paths, impacting Air India's operational efficiency.",
            "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/air-india-lobbies-to-use-airspace-over-chinas-xinjiang-as-financial-woes-mount/articleshow/125426787.cms",
            "category": "Defence",
            "date": "2025-11-19T04:22:21Z"
        }
    ]
}