{
    "last_updated": "2025-11-22T01:09:39.138518+00:00",
    "articles": [
        {
            "title": "Zelenskiy says he is ready to work on US-backed plan to end war in Ukraine",
            "summary": "Ukrainian President Volodymyr Zelenskiy, after meeting a top U.S. Army official, expressed readiness to collaborate with Washington on a plan to end the war. Zelenskiy anticipates discussing this further with President Biden. This engagement highlights ongoing high-level diplomatic efforts between Kyiv and Washington to formulate a joint strategy for a peaceful resolution to the prolonged conflict in Ukraine.",
            "url": "https://economictimes.indiatimes.com/news/defence/zelenskiy-says-he-is-ready-to-work-on-us-backed-plan-to-end-war-in-ukraine/articleshow/125474903.cms",
            "category": "International",
            "date": "2025-11-21T00:57:16Z"
        },
        {
            "title": "BREAKING: B-52s Swarm Venezuela! Maduro's Regime Is DOOMED",
            "summary": "Reports indicate B-52 Stratofortress bombers are currently headed south. While the specific mission, origin, or destination remains unstated in the provided text, the movement of these long-range strategic bombers is noteworthy. Such deployments often relate to exercises, deterrence, or regional security posture, making it a key development for defence awareness.",
            "url": "https://freerepublic.com/focus/f-news/4353731/posts",
            "category": "Defence",
            "date": "2025-11-21T00:37:42Z"
        },
        {
            "title": "BREAKING: B-52s Swarm Venezuela! Maduro's Regime Is DOOMED",
            "summary": "Breaking news indicates B-52 Stratofortress bombers are currently reported heading south. Such strategic bomber movements are significant in military operations, often signaling heightened readiness, ongoing exercises, or responses to evolving geopolitical situations. SSB aspirants should note these developments as they highlight global defense dynamics and strategic power projection, emphasizing the importance of airpower in modern security scenarios.",
            "url": "https://freerepublic.com/focus/f-bloggers/4353731/posts",
            "category": "Defence",
            "date": "2025-11-21T00:37:42Z"
        },
        {
            "title": "India set to reload as US clears ammo, missiles delivery",
            "summary": "Washington has approved India's urgent request for precision-guided munitions and anti-tank missiles following 'Operation Sindoor'. This clearance signifies bolstered Indo-US defence cooperation, aiming to enhance India's strategic capabilities amidst regional security dynamics. The acquisition strengthens India's arsenal, crucial for addressing emerging threats and maintaining defence readiness, vital for an aspiring officer to understand.",
            "url": "https://economictimes.indiatimes.com/news/defence/india-set-to-reload-as-us-clears-ammo-missiles-delivery/articleshow/125471428.cms",
            "category": "Defence",
            "date": "2025-11-21T00:32:00Z"
        },
        {
            "title": "Updated Week 12 Fantasy RB Rankings PPR: Running back tiers and lineup tips on who to start, best sleepers, streamers",
            "summary": "This article presents updated Week 12 fantasy football running back rankings specifically for PPR leagues. It offers detailed running back tiers and crucial lineup tips, guiding fantasy players on optimal choices for who to start. The analysis also identifies potential 'sleepers' and effective streaming options to help aspirants strategize and optimize their fantasy team selections.",
            "url": "https://www.sportingnews.com/us/fantasy/news/fantasy-football-rb-rankings-week-12-2025/b2388887c5471b43464ff57f",
            "category": "National",
            "date": "2025-11-21T00:30:00Z"
        },
        {
            "title": "India–France defence ties deepen with joint R&D framework across advanced technologies",
            "summary": "India's Defence Research & Development Organisation (DRDO) and France's Directorate General of Armaments (DGA) signed a technical agreement. This collaboration aims to leverage cooperation in defence research and armaments development. Such partnerships bolster India's defence manufacturing capabilities, foster technological exchange with key international allies, and strengthen national security by ensuring access to advanced defence technologies.",
            "url": "https://www.thehindubusinessline.com/news/indiafrance-defence-ties-deepen-with-joint-rd-framework-across-advanced-technologies/article70305889.ece",
            "category": "Defence",
            "date": "2025-11-21T00:19:01Z"
        },
        {
            "title": "Russian Defence Minister Andrei Belousov holds talks with Vice Chairman of the Central Military Commission of the People's Republic of China General Zhang Youxia",
            "summary": "The article commemorates the 80th anniversary of the common Victory over German fascism and Japanese militarism, marking a pivotal moment in history – the end of World War II. This celebration underscores the critical importance of preserving historical truth and collective memory regarding this global conflict. It highlights a shared international triumph against authoritarian regimes, emphasizing lessons learned from the past for future generations.",
            "url": "https://www.globalsecurity.org/wmd/library/news/russia/2025/11/russia-251120-russia-mod01.htm",
            "category": "International",
            "date": "2025-11-21T00:08:00Z"
        },
        {
            "title": "Fantasy Football 2025: Week 12 preview – Start/sit and more",
            "summary": "An update on the ongoing fantasy league season reveals its rapid progression, with playoffs scheduled for Week 15 after just three more weeks. Week 11 experienced unusually low scoring, indicating a challenging and unpredictable phase in the competition. This highlights the dynamic nature of competitive environments, a valuable insight for strategic thinking.",
            "url": "https://www.bigblueview.com/new-york-giants-analysis/145814/fantasy-football-2025-week-12-preview-start-sit-and-more",
            "category": "National",
            "date": "2025-11-20T22:30:00Z"
        },
        {
            "title": "Missing Endangered Person Alert issued for Wisconsin woman last seen in May 2025, concern for well-being",
            "summary": "Officials in Beaver Dam, Wisconsin, USA, have issued a Missing Endangered Person Alert for a 42-year-old woman. She was reportedly last in contact with family in May 2025. This alert indicates serious concerns for her immediate safety and well-being, prompting authorities to seek urgent public assistance in locating the individual amidst the challenging circumstances.",
            "url": "https://www.wearegreenbay.com/news/local-news/missing-endangered-person-alert-issued-for-wisconsin-woman-last-seen-in-may-2025-concern-for-well-being/",
            "category": "International",
            "date": "2025-11-20T21:34:09Z"
        },
        {
            "title": "Tom Brady and Birmingham unveil plans for new 62,000-seater stadium",
            "summary": "Birmingham City Football Club has unveiled plans for an ambitious 62,000-seat stadium, set to be the focal point of a massive urban redevelopment project in Bordesley Green. This initiative extends beyond sports, aiming to revitalise the area's infrastructure and economy. Such large-scale infrastructure and urban planning projects are crucial for national development and showcase significant regional investment.",
            "url": "https://www.101greatgoals.com/football/tom-brady-birmingham-unveil-plans-new-65000-seater-stadium/",
            "category": "National",
            "date": "2025-11-20T21:02:31Z"
        },
        {
            "title": "‘It makes Australia a target’: Wanning Sun on the realities of AUKUS",
            "summary": "A recent poll indicates strong Australian public support for the AUKUS nuclear submarine deal. This backing persists despite critics raising concerns over its immense price tag and potential US stability issues. The deal, a cornerstone for Australia's future defence capabilities and regional security strategy, signifies a major international collaboration that politicians continue to advocate for.",
            "url": "http://www.crikey.com.au/2025/11/21/aukus-australia-china-wanning-sun/",
            "category": "Defence",
            "date": "2025-11-20T20:53:06Z"
        },
        {
            "title": "NWSL Awards Presented By AT&T Celebrate Rising Stars And League Growth",
            "summary": "Host Jordan Angeli spoke at the 2025 NWSL Awards, presented by AT&T, on November 19, 2025, in San Jose, California. Held at the Montgomery Theater, this event honors outstanding achievements within the National Women's Soccer League. It signifies continued growth and recognition for professional women's football in the United States.",
            "url": "https://www.forbes.com/sites/jennnelson/2025/11/20/nwsl-awards-presented-by-att-celebrate-rising-stars-and-league-growth/",
            "category": "National",
            "date": "2025-11-20T20:49:28Z"
        },
        {
            "title": "News 11/21/25",
            "summary": "Ruthia He, CEO of the ADHD-prescribing platform Done, has been convicted on federal charges. These include illegally distributing Adderall, committing healthcare claims fraud, and conspiring to obstruct justice. This case underscores the vital importance of legal and ethical compliance in business, particularly within the healthcare technology sector, serving as a reminder of the serious consequences of corporate misconduct.",
            "url": "https://histalk2.com/2025/11/20/news-11-21-25/",
            "category": "National",
            "date": "2025-11-20T20:37:18Z"
        },
        {
            "title": "All 7 DCU Superheroes, Ranked By Threat Level",
            "summary": "The DC Universe, under James Gunn, is in its nascent phase, having released only three projects thus far. Significantly, two of these initial ventures are centered around antagonists or \"bad guys.\" This deliberate focus on villain-driven narratives marks an early strategic direction for the developing superhero franchise, hinting at its foundational themes and character emphasis.",
            "url": "http://comicbook.com/movies/list/all-7-dcu-superheroes-ranked-by-threat-level/",
            "category": "Sci & Tech",
            "date": "2025-11-20T20:00:00Z"
        },
        {
            "title": "DC's Green Lantern show gets an official 2026 release window",
            "summary": "DC Studios is expanding its Green Lantern universe, with Guy Gardner already introduced in Superman's upcoming film. Fans can anticipate meeting more members of the iconic Green Lantern Corps soon on HBO Max. This signifies a significant development for the superhero franchise, deepening its narrative on the streaming platform, offering new content for enthusiasts.",
            "url": "https://www.gamesradar.com/entertainment/dc-tv-shows/dcs-green-lantern-show-gets-an-official-2026-release-window/",
            "category": "Sci & Tech",
            "date": "2025-11-20T19:20:00Z"
        },
        {
            "title": "How critical minerals power our daily lives from the moment we wake up",
            "summary": "The modern world is deeply reliant on critical minerals, making daily functioning and technological advancement impossible without them. From household essentials to broader infrastructure, every aspect of modern life critically depends on these elements. Their indispensable role underscores their vital importance in today's interconnected global landscape for an SSB aspirant to understand.",
            "url": "https://www.abc.net.au/news/2025-11-21/how-critical-minerals-rare-earths-are-used-in-everyday-life/105980350",
            "category": "Sci & Tech",
            "date": "2025-11-20T18:52:59Z"
        },
        {
            "title": "Dr Jitendra lauds Indian Army’s mega health camp; Performs Bhoomi Pujan of Udhampur Chamber of Commerce Building",
            "summary": "Union Minister Dr. Jitendra Singh undertook significant public engagements in Udhampur, prominently visiting the Army Command Hospital. This interaction by a Union Minister with a crucial military medical facility underscores the government's attention to defense infrastructure and personnel welfare. For SSB aspirants, such visits highlight the importance of military medical services and the integration of civil administration with the armed forces, offering insights into national security priorities.",
            "url": "https://statetimes.in/dr-jitendra-lauds-indian-armys-mega-health-camp-performs-bhoomi-pujan-of-udhampur-chamber-of-commerce-building/",
            "category": "Defence",
            "date": "2025-11-20T18:45:06Z"
        },
        {
            "title": "Kashmir Times office in Jammu searched over alleged links to secessionist plot",
            "summary": "Authorities recently conducted a search operation at the Kashmir Times office in Jammu. The search was reportedly initiated due to alleged links of the publication to a secessionist plot. This development underscores ongoing efforts to investigate and counter activities that threaten national security and India's territorial integrity, particularly in sensitive regions, ensuring law and order.",
            "url": "https://timesofindia.indiatimes.com/india/kashmir-times-office-in-jammu-searched-over-alleged-links-to-secessionist-plot/articleshow/125470404.cms",
            "category": "National",
            "date": "2025-11-20T18:45:03Z"
        },
        {
            "title": "Talk to Centre to stop harassment of Kashmiris across India, Mehbooba urges Omar",
            "summary": "PDP chief Mehbooba Mufti has urged NC Vice President Omar Abdullah to engage the central government regarding reports of harassment and profiling of Kashmiris across India. Mufti highlighted concerns over alleged discrimination faced by Kashmiri individuals in various parts of the country, emphasizing the need for immediate intervention to ensure their safety and prevent further marginalization.",
            "url": "https://timesofindia.indiatimes.com/india/talk-to-centre-to-stop-harassment-of-kashmiris-across-india-mehbooba-urges-omar/articleshow/125470136.cms",
            "category": "National",
            "date": "2025-11-20T18:39:29Z"
        },
        {
            "title": "Russia's alleged hybrid warfare targeting seafloor cables vital to modern life",
            "summary": "Over 95% of global internet and communication data relies on vast undersea fiber optic cable networks. These critical infrastructures, spanning ocean floors, are vital for international connectivity, economic stability, and national security. Their immense strategic importance makes them potential targets, underscoring the need for robust protection and resilience planning in modern defence strategies.",
            "url": "https://www.cbsnews.com/news/russia-alleged-hybrid-warfare-undersea-cables/",
            "category": "Defence",
            "date": "2025-11-20T18:35:26Z"
        },
        {
            "title": "DAVE THE DIVER now available for Xbox Series and Xbox One; physical edition announced for PS5 and Switch 2",
            "summary": "MINTROCKET has launched its acclaimed single-player adventure RPG, DAVE THE DIVER, for Xbox Series consoles. This popular game is now available via the Microsoft Store, alongside its PC version. This strategic release expands the game's accessibility, allowing a broader audience to experience its unique blend of exploration, fishing, and restaurant management gameplay.",
            "url": "https://www.gematsu.com/2025/11/dave-the-diver-now-available-for-xbox-series-and-xbox-one-physical-edition-announced-for-ps5-and-switch-2",
            "category": "Sci & Tech",
            "date": "2025-11-20T18:05:37Z"
        },
        {
            "title": "Lanterns Release Date Window Delayed for DCU HBO TV Show",
            "summary": "The upcoming HBO Original drama series, \"Lanterns,\" from DC Studios, has had its release date officially delayed. This announcement was made during a press presentation by Casey Bloys, Chairman and CEO of HBO and HBO Max Content. The series, a significant project for the studios, will now premiere later than initially planned, affecting its anticipated global rollout.",
            "url": "https://www.superherohype.com/tv/640178-lanterns-release-date-delayed-new-premiere-window-dcu-show",
            "category": "International",
            "date": "2025-11-20T18:03:21Z"
        },
        {
            "title": "Lanterns’ Schedule Push Might Be Good News For Fans of Cosmic DC",
            "summary": "Filmmaker James Gunn has announced initial details for the new 'Lanterns' series, based on the Green Lantern comic. Despite the franchise's inherently cosmic nature, early discussions indicate a surprising focus on terrestrial elements. This suggests a potentially grounded approach for the upcoming show, which traditionally features intergalactic policing, hinting at a fresh creative direction for the superhero property.",
            "url": "http://www.denofgeek.com/tv/lanterns-schedule-push-good-news-fans-cosmic-dc/",
            "category": "Sci & Tech",
            "date": "2025-11-20T18:00:00Z"
        },
        {
            "title": "Plans for Birmingham City's 62,000-seater stadium revealed",
            "summary": "Birmingham City Football Club has unveiled plans for a new 62,000-capacity stadium in the West Midlands. The club targets having this facility ready for the start of the 2030/2031 season. This ambitious project signifies a major infrastructure upgrade, aiming to enhance the club's future prospects and provide a modern venue for its supporters and the region.",
            "url": "https://www.bbc.com/news/articles/cly9y030r37o",
            "category": "National",
            "date": "2025-11-20T17:43:04Z"
        },
        {
            "title": "Brady, Bellingham hail Birmingham's new stadium",
            "summary": "Birmingham City Football Club unveiled plans for a new 62,000-seat stadium, a project aiming to propel the second-division club and the city onto a \"trajectory towards greatness.\" This significant infrastructure development promises enhanced facilities and economic benefits for the region. It highlights major investments in sports and urban development abroad, relevant for understanding global infrastructure trends.",
            "url": "https://www.espn.com/soccer/story/_/id/47037045/tom-brady-jude-bellingham-birmingham-city-new-stadium-unveiling",
            "category": "International",
            "date": "2025-11-20T17:42:06Z"
        },
        {
            "title": "The DCU’s Next Big Project Just Got a Major Delay (Is It in Trouble?)",
            "summary": "DC Studios is set for a significant expansion, following recent successes with 'Superman' and 'Peacemaker Season 2'. The studio has multiple new DC Universe projects planned for the upcoming year, encompassing both major cinematic releases and television series. This strategic push aims to broaden the DC franchise's presence and engage a global audience across various entertainment platforms, promising a robust future pipeline.",
            "url": "http://comicbook.com/tv-shows/news/the-dcus-next-big-project-just-got-a-major-delay-is-it-in-trouble/",
            "category": "International",
            "date": "2025-11-20T17:27:14Z"
        },
        {
            "title": "LANTERNS HBO Max Series Officially Delayed; Update On THE PENGUIN Season 2",
            "summary": "The project identified as 'Lanterns' has officially confirmed a significant delay, pushing its completion timeline into the next year. Contrary to recent reports, the delay is not as extensive as previously rumored last month, but it still represents a notable postponement from its original schedule, requiring revised planning for stakeholders.",
            "url": "https://comicbookmovie.com/tv/dc/lanterns/lanterns-hbo-max-series-officially-delayed-update-on-the-penguin-season-2-a225010",
            "category": "Sci & Tech",
            "date": "2025-11-20T17:14:00Z"
        },
        {
            "title": "Azerbaijan Bets Big on China to Power Its Green Energy Corridor",
            "summary": "This news highlights diverse global developments: Poland accuses Russian intelligence, signaling heightened geopolitical tensions. Separately, significant technological breakthroughs, especially ultra-high-pressure drilling, are unlocking new possibilities. Concurrently, Saudi Arabia, under MBS, is strategically enhancing its global influence. These developments span international security, scientific innovation, and geopolitical shifts.",
            "url": "https://oilprice.com/Energy/Energy-General/Azerbaijan-Bets-Big-on-China-to-Power-Its-Green-Energy-Corridor.html",
            "category": "International",
            "date": "2025-11-20T17:00:00Z"
        },
        {
            "title": "Birmingham City unveils plan for new stadium that Tom Brady says will be 'a blast'",
            "summary": "Birmingham City FC has unveiled ambitious plans to build a new 62,000-seat stadium in Birmingham, England. This significant development aims to elevate the second-division club's standing and boost the city's profile. The costly project signals the club's trajectory towards greater success and enhances local infrastructure, promising a major impact on the region's sporting and economic landscape.",
            "url": "https://sports.yahoo.com/article/birmingham-city-unveils-plan-stadium-165525234.html",
            "category": "National",
            "date": "2025-11-20T16:55:25Z"
        },
        {
            "title": "Russian video shows soldiers walking freely through ruins of Ukraine's Pokrovsk",
            "summary": "Russia's defence ministry released video depicting its soldiers moving freely through the southern Ukrainian city of Pokrovsk, patrolling deserted streets. This aims to project Russian control and presence in the conflict zone. For SSB aspirants, it underscores the ongoing military operations in Ukraine, highlighting the complexities of geopolitical territorial disputes and their significance in international security dynamics.",
            "url": "https://www.thestar.com.my/news/world/2025/11/21/russian-video-shows-soldiers-walking-freely-through-ruins-of-ukraine039s-pokrovsk",
            "category": "Defence",
            "date": "2025-11-20T16:47:00Z"
        },
        {
            "title": "US approves sale of Javelin anti-tank missiles & Excalibur munitions to India",
            "summary": "The US has approved the sale of advanced Javelin anti-tank missiles and Excalibur precision-guided munitions to India. This significant acquisition deepens defence cooperation between the two nations, bolstering India's military capabilities. The state-of-the-art weaponry will enhance India's defensive posture and strategic readiness, supporting its ongoing armed forces modernization efforts.",
            "url": "https://timesofindia.indiatimes.com/india/us-approves-sale-of-javelin-anti-tank-missiles-excalibur-munitions-to-india/articleshow/125467406.cms",
            "category": "Defence",
            "date": "2025-11-20T16:40:33Z"
        },
        {
            "title": "Lanterns: Green Lantern Series Eyeing Late Summer 2026 HBO Debut",
            "summary": "Casey Bloys, Chairman/CEO of HBO & HBO Max Content, announced that the highly anticipated series \"Lanterns,\" starring Aaron Pierre and Kyle Chandler, will premiere in late Summer 2026. This major production by the global entertainment giant HBO Max highlights the continuous expansion of premium streaming content, adding a significant new title to its future lineup for international audiences.",
            "url": "https://bleedingcool.com/tv/lanterns-green-lantern-series-eyeing-late-summer-2026-hbo-debut/",
            "category": "International",
            "date": "2025-11-20T16:37:04Z"
        },
        {
            "title": "China Defends Venezuela, Demanding U.S. Replace Anti-Drug Efforts with 'Normal' Policing",
            "summary": "China's Foreign Ministry condemned external interference in Venezuela's internal affairs, directly criticizing the United States. During a press briefing, Beijing demanded Washington cease involvement, emphasizing respect for Venezuela's sovereignty. This action highlights ongoing diplomatic friction between China and the US over geopolitical influence in Latin America, an important point for understanding global power dynamics.",
            "url": "https://www.breitbart.com/asia/2025/11/20/china-defends-venezuela-demanding-u-s-replace-anti-drug-efforts-with-normal-policing/",
            "category": "International",
            "date": "2025-11-20T16:36:11Z"
        },
        {
            "title": "DC Studios’ ‘Lanterns’ Pushed to End of Summer 2026 at HBO",
            "summary": "DC Studios' highly anticipated series, \"Lanterns,\" is targeting an end of summer 2026 debut on HBO and HBO Max, as announced by CEO Casey Bloys during a recent slate presentation in New York City. While an official premiere date is yet to be shared, this revelation provides an anticipated timeline for the superhero drama's arrival, exciting fans awaiting the new installment in the DC universe.",
            "url": "https://www.thewrap.com/lanterns-hbo-premiere-summer-2026/",
            "category": "International",
            "date": "2025-11-20T16:11:53Z"
        },
        {
            "title": "India needs to adopt next-gen technologies for human spaceflight missions: Shubanshu Shukla",
            "summary": "Group Captain Shubhanshu Shukla, India's second astronaut, emphasized India's critical need to rapidly adopt next-generation space technologies. He advocated for advanced solutions such as touch-screen spacecraft controls and sophisticated life support systems. This technological push is vital for bolstering India's space capabilities, fostering self-reliance, and ensuring a competitive edge in global space exploration, aligning with national progress and future strategic importance.",
            "url": "https://economictimes.indiatimes.com/tech/technology/india-needs-to-adopt-next-gen-technologies-for-human-spaceflight-missions-shubanshu-shukla/articleshow/125466119.cms",
            "category": "Sci & Tech",
            "date": "2025-11-20T15:20:13Z"
        },
        {
            "title": "Australia's naval nuclear propulsion: AUKUS update to IAEA Board of Governors, November 2025",
            "summary": "Australia, the UK, and the US addressed an international body, likely the IAEA, acknowledging the Director General's latest report on Australia's naval nuclear propulsion program. This refers to the AUKUS security pact, under which Australia is acquiring nuclear-powered submarines with UK/US assistance, emphasizing adherence to non-proliferation standards and the development of this significant defence capability.",
            "url": "https://www.gov.uk/government/speeches/australias-naval-nuclear-propulsion-aukus-update-to-iaea-board-of-governors-november-2025",
            "category": "Defence",
            "date": "2025-11-20T15:11:50Z"
        },
        {
            "title": "Missiles and militias: Maduro fortifies Caracas’ coastal access as US military looms",
            "summary": "Venezuelan President Nicolás Maduro unveiled a comprehensive defense plan to fortify the strategic corridor between Caracas and the coastal state of La Guaira. This initiative aims to bolster national security and critical infrastructure in a vital economic and military region, showcasing Venezuela's efforts to enhance defensive capabilities and strategic preparedness.",
            "url": "https://www.miamiherald.com/news/nation-world/world/americas/venezuela/article312993653.html",
            "category": "Defence",
            "date": "2025-11-20T15:07:18Z"
        },
        {
            "title": "Birch Allergy Market Growth Outlook: CAGR of 9.8% and Value Reaching USD 2.60 Billion by 2032",
            "summary": "The global birch allergy market is projected for substantial growth, estimated to reach USD 2.60 billion by 2032 from USD 1.35 billion in 2025. This significant expansion highlights the increasing importance and economic potential within specialized health and medical sectors. Aspirants should observe such trends in global market dynamics, particularly concerning health-related advancements and their economic implications.",
            "url": "https://www.globenewswire.com/news-release/2025/11/20/3192110/0/en/Birch-Allergy-Market-Growth-Outlook-CAGR-of-9-8-and-Value-Reaching-USD-2-60-Billion-by-2032.html",
            "category": "Sci & Tech",
            "date": "2025-11-20T15:07:00Z"
        },
        {
            "title": "IN PICTURES: Bundeswehr soldiers storm a Berlin U-bahn station",
            "summary": "German army soldiers conducted a realistic urban warfare training exercise in Berlin's metro system on Wednesday. The drill involved navigating underground tunnels and reaching passenger trains, simulating operations within complex urban environments and critical infrastructure. This exercise enhances troop readiness for security challenges in densely populated areas, a crucial aspect of modern defence strategies.",
            "url": "https://www.thelocal.de/20251120/in-pictures-bundeswehr-soldiers-storm-a-berlin-u-bahn-station",
            "category": "Defence",
            "date": "2025-11-20T14:57:50Z"
        },
        {
            "title": "Travis Kelce & Jason Kelce ‘Dominates’ Giants’ Cam Skattebo on Podcast",
            "summary": "Prominent NFL figures Travis and Jason Kelce, on their podcast, playfully teased New York Giants star Cam Skattebo. The brothers light-heartedly critiqued Skattebo's views on earning potential, sharing hilarious jokes and a good laugh. This engaging interaction offers a glimpse into sports personalities' camaraderie and candid discussions beyond the field.",
            "url": "https://www.mandatory.com/news/1690401-travis-kelce-jason-kelce-cam-skattebo-podcast",
            "category": "National",
            "date": "2025-11-20T14:13:02Z"
        },
        {
            "title": "Navy places ₹1,400-cr orders with start-ups, MSMEs to boost indigenous innovation",
            "summary": "The Indian Navy has issued procurement orders totaling ₹1,400 crore to 16 start-ups and MSMEs since 2018. This strategic initiative aims to significantly strengthen India's maritime capabilities and accelerate self-reliance (Aatmanirbharta) in the defence sector. It underscores the Navy's commitment to integrating indigenous innovation, boosting national security through domestic industry development, a crucial step for aspirants to note.",
            "url": "https://www.thehindubusinessline.com/news/navy-places-1400-cr-orders-with-start-ups-msmes-to-boost-indigenous-innovation/article70303625.ece",
            "category": "Defence",
            "date": "2025-11-20T14:10:38Z"
        },
        {
            "title": "San Diego County police agencies access many private license plate readers with minimal oversight",
            "summary": "Las Americas Premium Outlets has deployed discreet black cameras at its entrances to monitor vehicles. These systems capture the license plate, make, and model of every car entering the parking lot. This widespread adoption of surveillance technology for data collection by commercial entities raises considerations regarding privacy and the extent of monitoring in public-private spaces.",
            "url": "https://www.kpbs.org/news/public-safety/2025/11/20/san-diego-county-police-agencies-access-many-private-license-plate-readers-with-minimal-oversight",
            "category": "Sci & Tech",
            "date": "2025-11-20T14:00:00Z"
        },
        {
            "title": "LG Elecronics stock gaining strength, as analysts remain bullish",
            "summary": "LG Electronics India Ltd (LGEIL) shares are rising despite a recent dip in net profit. Analysts remain bullish, projecting future revenue growth and improved margins. This trend shows market confidence in LGEIL's long-term prospects, demonstrating how investor sentiment and future expectations can influence a major national company's stock performance more than immediate financial results.",
            "url": "https://www.thehindubusinessline.com/markets/lg-elecronics-stock-gaining-strength-as-analysts-remain-bullish/article70303396.ece",
            "category": "National",
            "date": "2025-11-20T13:25:26Z"
        },
        {
            "title": "Boeing’s MQ-28A Ghost Bat Will Fire AIM-120 AMRAAM in December",
            "summary": "Boeing Defence Australia is preparing for a live-fire test next month, involving its MQ-28A Ghost Bat Collaborative Combat Aircraft (CCA) launching an air-to-air missile. This significant development advances the capabilities of unmanned combat aircraft, showcasing the growing integration of AI and autonomous systems in modern air warfare. The test marks a crucial step in developing next-generation combat aviation platforms.",
            "url": "https://theaviationist.com/2025/11/20/mq-28a-to-fire-aim-120-in-december/",
            "category": "Defence",
            "date": "2025-11-20T13:16:49Z"
        },
        {
            "title": "Travis Kelce Would Chew Taco ‘Hard as F***’",
            "summary": "On their latest 'New Heights Podcast', NFL stars Travis and Jason Kelce discussed various football topics, including franchise records and Sanders' NFL debut. The episode also featured a unique segment dubbed 'Taco Domination'. This podcast offers insights into current American football conversations and player perspectives, appealing to fans following prominent national athletes and their media engagements.",
            "url": "https://www.mandatory.com/news/1690378-travis-kelce-taco-new-heights-podcast",
            "category": "National",
            "date": "2025-11-20T13:14:30Z"
        },
        {
            "title": "Matt Bowen's ultimate guide to winning a fantasy football championship",
            "summary": "The article focuses on fantasy football playoffs, detailing the crucial objective of maximizing points in weekly head-to-head matchups. It outlines the strategic importance of optimal player management and tactical decisions during this high-stakes phase, where competitive analysis and performance are key to securing victory in the virtual sports league.",
            "url": "https://www.espn.com/fantasy/football/story/_/id/47023923/fantasy-football-playoffs-tips-strategy-pickups",
            "category": "National",
            "date": "2025-11-20T12:59:39Z"
        }
    ]
}