{
    "last_updated": "2025-11-19T06:23:29.388668+00:00",
    "articles": [
        {
            "title": "IAF, French Air Force launch Exercise Garuda-25 to boost joint operational capabilities",
            "summary": "The Indian Air Force (IAF) announced Exercise Garuda-25, a significant bilateral air exercise with the French Air and Space Force (FASF). This joint training highlights the growing defence partnership between India and France, aiming to enhance interoperability, share best practices, and strengthen aerial combat capabilities. Such exercises are crucial for strategic cooperation and national security.",
            "url": "https://www.thehindubusinessline.com/economy/logistics/iaf-french-air-force-launch-exercise-garuda-25-to-boost-joint-operational-capabilities/article70293406.ece",
            "category": "Defence",
            "date": "2025-11-18T05:51:03Z"
        },
        {
            "title": "North Korea denounces nuclear agreement between South and US",
            "summary": "North Korea has warned of a 'nuclear domino' effect following an agreement between South Korea and the United States to develop atomic-powered submarines. Pyongyang views this military cooperation as a significant escalation, potentially destabilising regional security. This development highlights growing tensions and the strategic arms race in the Indo-Pacific, impacting international relations and defence postures.",
            "url": "https://www.dw.com/en/north-korea-denounces-nuclear-agreement-between-south-and-us/a-74784982",
            "category": "Defence",
            "date": "2025-11-18T05:17:00Z"
        },
        {
            "title": "On tiny Christmas Island, Google spurs renewable energy push for Indian Ocean data hub",
            "summary": "Australia's remote Christmas Island has sufficient power to host a new Google data centre without impacting local supply. This significant development could enhance the island's infrastructure and drive a strong push towards renewable energy adoption. It underscores the global expansion of tech giants and the strategic importance of remote locations for data infrastructure.",
            "url": "https://economictimes.indiatimes.com/tech/technology/on-tiny-christmas-island-google-spurs-renewable-energy-push-for-indian-ocean-data-hub/articleshow/125402135.cms",
            "category": "Sci & Tech",
            "date": "2025-11-18T05:11:58Z"
        },
        {
            "title": "Dear Abby: Chummy ex crossed a line, loses free rides",
            "summary": "A reader seeks advice from Dear Abby about their friendly ex-husband, Hal, living two doors away. Although Hal can drive, he consistently asks the reader and her current husband for rides during family visits. While they initially don't mind, the ongoing situation hints at developing complexities in managing interpersonal boundaries and expectations within unique family dynamics, a common social challenge requiring careful navigation.",
            "url": "https://www.bostonherald.com/2025/11/18/dear-abby-chummy-ex-crossed-a-line-loses-free-rides/",
            "category": "National",
            "date": "2025-11-18T05:01:57Z"
        },
        {
            "title": "India to triple spacecraft output over next three years",
            "summary": "ISRO aims to triple its annual spacecraft production within three years, a significant move bolstering India's self-reliance and global standing in space technology. This ambitious expansion, coupled with seven more launches planned this year, highlights India's accelerated progress in space, vital for strategic applications, communication, and scientific advancement. Such growth is crucial for national power projection.",
            "url": "https://www.rt.com/india/627895-india-triple-spacecraft-output/",
            "category": "Sci & Tech",
            "date": "2025-11-18T04:48:31Z"
        },
        {
            "title": "Malayalam cinema's first action hero refused body doubles for daring stunts, died while performing daredevil action sequence. He was only 41",
            "summary": "Malayalam cinema carved a unique identity from its early days, opting for grounded storytelling and realism over the exaggerated spectacle often seen in neighbouring Tamil and Telugu film industries. This distinct focus on authentic narratives and character depth has consistently set it apart, contributing significantly to India's diverse cinematic landscape.",
            "url": "https://economictimes.indiatimes.com/magazines/panache/malayalam-cinemas-first-action-hero-refused-body-doubles-for-daring-stunts-died-while-performing-daredevil-action-sequence-he-was-only-41/articleshow/125400725.cms",
            "category": "National",
            "date": "2025-11-18T04:06:14Z"
        },
        {
            "title": "FIIs trim stakes in GRSE, BDL and 10 more defence stocks in Sept. Why is the firepower lacking?",
            "summary": "Foreign Institutional Investors (FIIs) significantly reduced their stakes in India's defence sector during the September quarter, paring positions across 11 companies. This indicates a perceived diminishing confidence in the \"India defence story\" among these foreign investors. Such trends are crucial for understanding economic sentiment affecting strategic sectors like defence, impacting indigenous development and market dynamics.",
            "url": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-trim-stakes-in-grse-bdl-and-10-more-defence-stocks-in-sept-why-is-the-firepower-lacking/articleshow/125400751.cms",
            "category": "Defence",
            "date": "2025-11-18T03:51:44Z"
        },
        {
            "title": "North Korea says Seoul-US sub deal will trigger 'nuclear domino' effect",
            "summary": "North Korea has denounced a recent agreement between South Korea and the United States concerning the construction of nuclear-powered submarines. Pyongyang, via state media, labeled this collaboration as a severe security threat and a provocative act. This condemnation underscores heightened tensions on the Korean Peninsula and raises significant concerns regarding regional stability and the ongoing arms race in Northeast Asia.",
            "url": "https://www.spacewar.com/reports/North_Korea_says_Seoul-US_sub_deal_will_trigger_nuclear_domino_effect_999.html",
            "category": "Defence",
            "date": "2025-11-18T03:31:51Z"
        },
        {
            "title": "North Korea says Seoul-US submarine deal will trigger 'nuclear domino' effect",
            "summary": "North Korea has strongly condemned a recent agreement between South Korea and the United States concerning Seoul's acquisition of nuclear-powered submarines. Pyongyang, through its state media, warned that this deal could trigger a dangerous 'nuclear domino' effect, escalating regional tensions and proliferation risks. This development highlights growing security concerns on the Korean Peninsula amidst evolving defence strategies.",
            "url": "https://economictimes.indiatimes.com/news/defence/north-korea-says-seoul-us-submarine-deal-will-trigger-nuclear-domino-effect/articleshow/125399919.cms",
            "category": "International",
            "date": "2025-11-18T02:49:19Z"
        },
        {
            "title": "North Korea says Seoul-US sub deal will trigger ‘nuclear domino’ effect",
            "summary": "South Korean President Lee Jae Myung announced the finalization of a long-awaited security and trade agreement with the United States. This significant pact strengthens the alliance between Seoul and Washington, covering defence cooperation and economic ties. The agreement has predictably drawn strong condemnation from North Korea, exacerbating existing regional tensions and highlighting the complex geopolitical landscape.",
            "url": "https://www.digitaljournal.com/world/north-korea-says-seoul-us-sub-deal-will-trigger-nuclear-domino-effect/article",
            "category": "International",
            "date": "2025-11-18T02:32:20Z"
        },
        {
            "title": "Why these dozen stocks will remain in focus on Tuesday, November 18, 2025",
            "summary": "Pritesh Vinay, Director of Finance at JSW Energy, has resigned from his position to pursue new career opportunities outside the JSW Group. Vinay had a long association of 13 years with the JSW Group. This executive movement is a notable development for the prominent Indian energy company, reflecting internal transitions within major national corporations.",
            "url": "https://www.thehindubusinessline.com/markets/why-these-dozen-stocks-will-remain-in-focus-on-tuesday-november-18-2025/article70293029.ece",
            "category": "National",
            "date": "2025-11-18T02:10:55Z"
        },
        {
            "title": "Joint Statement by UK and Italian Foreign and Defence Ministers",
            "summary": "UK and Italian Foreign and Defence Ministers, including Yvette Cooper and Antonio Tajani, convened virtually to issue a joint statement. This high-level engagement between the two nations' top diplomats and defence officials signifies ongoing strategic collaboration. Such meetings are vital for coordinating foreign policy and defence strategies, reflecting their commitment to addressing shared international security interests and strengthening bilateral ties.",
            "url": "https://www.globalsecurity.org/wmd/library/news/uk/2025/uk-251117-ukmod02.htm",
            "category": "International",
            "date": "2025-11-18T01:43:51Z"
        },
        {
            "title": "Inside billionaire Gabe Newell’s new $500 million superyacht, which has a submarine garage and its own hospital",
            "summary": "Gabe Newell's company, Valve, known for its popular Steam PC gaming platform, recently announced three new hardware products. This strategic move, revealed last Wednesday, signifies Valve's continued innovation and expansion beyond software into gaming hardware. Aspirants should note how tech companies continually evolve their offerings in competitive markets like gaming.",
            "url": "https://biztoc.com/x/c7b967b335c7477d",
            "category": "Sci & Tech",
            "date": "2025-11-17T17:36:24Z"
        },
        {
            "title": "Pierce Brosnan says he's heard his Black Adam character is \"going to have his own show, or his own movie\" and is \"going to be in the next Superman\"",
            "summary": "Actor Pierce Brosnan is reportedly considering a return to the comic book movie genre. He previously made his DCEU debut in the 2022 film 'Black Adam'. However, the future of 'Black Adam' had seemed uncertain following recent developments involving James Gunn and Pete, indicating a potential shift in the DCEU's creative direction. Brosnan's possible comeback hints at new roles.",
            "url": "https://www.gamesradar.com/entertainment/dc-movies/pierce-brosnan-says-hes-heard-his-black-adam-character-is-going-to-have-his-own-show-or-his-own-movie-and-is-going-to-be-in-the-next-superman/",
            "category": "International",
            "date": "2025-11-17T17:27:17Z"
        },
        {
            "title": "Inside billionaire Gabe Newell’s new $500 million superyacht, which has a submarine garage and its own hospital",
            "summary": "Gabe Newell, co-founder of Valve Corporation, acquired the Dutch shipyard Oceanco in August for an undisclosed sum. This move followed his collaboration with the company on designing and building his personal superyacht, 'Leviathan.' The acquisition represents a significant international business transaction, consolidating design and construction capabilities under Newell's direct ownership within the luxury yacht industry.",
            "url": "https://fortune.com/2025/11/17/gabe-newell-leviathan-superyacht-features-submarine-garage-hospital-spa-gaming-pcs-inkfish-oceanco/",
            "category": "International",
            "date": "2025-11-17T17:19:40Z"
        },
        {
            "title": "Betty Gilpin Joins Ron Howard’s Amazon MGM Military Drama ‘Alone At Dawn’",
            "summary": "Actress Betty Gilpin joins Adam Driver and Anne Hathaway in Ron Howard's upcoming Amazon MGM military drama, 'Alone at Dawn'. Based on a 2019 book, this film promises to explore military themes and narratives. For SSB aspirants, such productions offer valuable insights into the portrayal of service life and military history, potentially sparking discussions on leadership and courage.",
            "url": "http://deadline.com/2025/11/alone-at-dawn-casts-betty-gilpin-amazon-mgm-1236620312/",
            "category": "Defence",
            "date": "2025-11-17T17:15:55Z"
        }
    ]
}