{
    "last_updated": "2025-11-22T06:21:15.142044+00:00",
    "articles": [
        {
            "title": "Why used cars are becoming the smarter choice for Indian buyers",
            "summary": "India's used car market is booming, increasingly becoming the smarter choice for buyers nationwide. This surge is driven by heightened affordability, making car ownership more accessible, alongside the convenience offered by robust digital platforms. The trend reflects evolving consumer preferences and economic dynamics within India, indicating a significant shift in the automotive sector's purchasing landscape.",
            "url": "https://timesofindia.indiatimes.com/auto/why-used-cars-are-becoming-the-smarter-choice-for-indian-buyers/articleshow/125478910.cms",
            "category": "National",
            "date": "2025-11-21T06:15:47Z"
        },
        {
            "title": "Assam Police Recruitment 2025 notification for 4000 vacancies releasing soon: Check where to register, selection process details here",
            "summary": "The Assam Police will soon release a notification for 4000 vacancies in its 2025 recruitment drive. This offers a significant career opportunity for SSB aspirants in law enforcement and public service. Details on registration, eligibility, and the selection process will be available shortly. Aspirants should monitor official Assam Police channels for timely updates and prepare thoroughly for this state-level recruitment.",
            "url": "https://timesofindia.indiatimes.com/education/news/assam-police-recruitment-2025-notification-for-4000-vacancies-releasing-soon-check-where-to-register-selection-process-details-here/articleshow/125478739.cms",
            "category": "National",
            "date": "2025-11-21T06:08:36Z"
        },
        {
            "title": "CBSE limits second Class 10 Board Exam attempt for these students in 2026: Check details here",
            "summary": "CBSE has announced a significant change for Class 10 Board exams starting in 2026. Students who fail to pass the first attempt will now be limited to only one subsequent second attempt to clear the exam. This new rule aims to streamline the examination process and encourage students to perform well in their initial attempts, impacting lakhs of aspirants nationwide.",
            "url": "https://timesofindia.indiatimes.com/education/news/cbse-limits-second-class-10-board-exam-attempt-for-these-students-in-2026-check-details-here/articleshow/125477872.cms",
            "category": "National",
            "date": "2025-11-21T05:41:53Z"
        },
        {
            "title": "Russia downs 33 Ukrainian drones overnight, defence ministry says",
            "summary": "The Russian Defence Ministry reported intercepting and destroying 33 Ukrainian drones overnight across five Russian regions, Crimea, and the Black Sea. This significant drone attack highlights ongoing military tensions and active aerial engagements in the conflict zone, underscoring the persistent threat of unmanned aerial vehicles in modern warfare.",
            "url": "https://www.thestar.com.my/news/world/2025/11/21/russia-downs-33-ukrainian-drones-overnight-defence-ministry-says",
            "category": "Defence",
            "date": "2025-11-21T05:40:00Z"
        },
        {
            "title": "TN TET 2025 held for 3.75 lakh candidates: Teachers demand cut-off reduction to 50%, details here",
            "summary": "Teachers' federations in Tamil Nadu are demanding a 50% cut-off reduction for the TN TET 2025, in which 3.75 lakh candidates participated. This initiative seeks to enhance recruitment prospects for aspiring educators, addressing concerns over existing qualification thresholds. The demand reflects ongoing debates within state education policy on making teacher recruitment more accessible and effective.",
            "url": "https://timesofindia.indiatimes.com/education/news/tn-tet-2025-held-for-3-75-lakh-candidates-teachers-demand-cut-off-reduction-to-50-details-here/articleshow/125478211.cms",
            "category": "National",
            "date": "2025-11-21T05:36:43Z"
        },
        {
            "title": "Zelensky receives US plan to end war in Ukraine and expects talks with Trump",
            "summary": "Ukrainian President Zelensky has received a draft US plan aimed at resolving the war in Ukraine. He anticipates upcoming discussions with former US President Donald Trump on this proposal. This development underscores ongoing international diplomatic efforts to find a peaceful resolution to the conflict, involving key global figures in potential peace initiatives and negotiations.",
            "url": "https://www.independent.ie/world-news/zelensky-receives-us-plan-to-end-war-in-ukraine-and-expects-talks-with-trump/a714909816.html",
            "category": "International",
            "date": "2025-11-21T05:30:00Z"
        },
        {
            "title": "Zelensky receives draft US plan to end war in Ukraine and expects talks with Trump",
            "summary": "Ukrainian President Zelensky has received a draft US peace plan aimed at ending the war in Ukraine. His office announced that Zelensky anticipates holding talks with former US President Donald Trump in the coming days to discuss the proposal. This development highlights ongoing international diplomatic efforts to find a resolution to the prolonged conflict.",
            "url": "https://www.independent.ie/world-news/europe/zelensky-receives-draft-us-plan-to-end-war-in-ukraine-and-expects-talks-with-trump/a714909816.html",
            "category": "International",
            "date": "2025-11-21T05:30:00Z"
        },
        {
            "title": "Brian Cashman confident Yankees have cash flexibility despite $300M max",
            "summary": "Yankees owner Hal Steinbrenner is currently deliberating the team's 2026 payroll, particularly its sustainable limit. He has expressed reservations about the feasibility of maintaining a budget potentially exceeding $300 million. While the precise final figure remains his decision, Steinbrenner's emphasis on financial sustainability will be a key factor in determining the Yankees' future spending.",
            "url": "https://nypost.com/2025/11/21/sports/brian-cashman-confident-yankees-have-cash-flexibility-despite-300m-max/",
            "category": "International",
            "date": "2025-11-21T05:27:31Z"
        },
        {
            "title": "Earthquake of magnitude 5.2 jolts Pakistan; more tremors recorded this week",
            "summary": "A Putin aide heavily criticized France's substantial $23 billion arms deal with Kyiv, alleging that Ukrainian President Zelensky is personally profiting from the significant military aid. This sharp condemnation highlights ongoing international tensions and accusations of corruption regarding military support amidst the conflict, emphasizing a propaganda battle surrounding aid transparency and leadership integrity.",
            "url": "https://timesofindia.indiatimes.com/world/pakistan/earthquake-of-magnitude-5-2-jolts-pakistan-more-tremors-recorded-this-week/articleshow/125477827.cms",
            "category": "Defence",
            "date": "2025-11-21T05:18:42Z"
        },
        {
            "title": "Blue Jays stay competitive, drop in state tourney quarterfinals",
            "summary": "Jamestown High School's volleyball team achieved a significant upset by winning the first set against Fargo Davies in the Class AA NDHSAA State Tournament quarterfinals. The team, displaying confidence, felt they had the capability to secure a quick victory in just three sets, indicating a strong performance and strategic edge in the ongoing state-level competition.",
            "url": "https://www.jamestownsun.com/sports/prep/blue-jays-stay-competitive-drop-in-state-tourney-quarterfinals",
            "category": "National",
            "date": "2025-11-21T04:47:00Z"
        },
        {
            "title": "New research uncovers hidden divide in West Coast killer whales",
            "summary": "Recent research reveals that transient killer whales along the West Coast, spanning British Columbia to California, are not a single group but comprise two distinct subpopulations. These newly identified 'inner' and 'outer' groups highlight specialized ecological roles and behaviors, offering crucial insights for conservation strategies and understanding marine biodiversity. This discovery refines our knowledge of these apex predators.",
            "url": "https://www.sciencedaily.com/releases/2025/11/251120002604.htm",
            "category": "Sci & Tech",
            "date": "2025-11-21T04:40:28Z"
        },
        {
            "title": "Dubai Air Show 2025: 'India is a strategic priority for us,' says US tech firm SAIC's top officer",
            "summary": "US-based Science Applications International Corporation (SAIC), a major tech solutions provider, has declared India a \"strategic priority.\" SAIC's Chief Growth Officer, Murtaza Ahmed, indicated a strong intent to focus on the Indian market. This underscores India's increasing appeal for global corporations in strategic technology and business domains, potentially fostering enhanced collaboration in key sectors.",
            "url": "https://economictimes.indiatimes.com/news/india/dubai-air-show-2025-india-is-a-strategic-priority-for-us-says-us-tech-firm-saics-top-officer/articleshow/125477090.cms",
            "category": "Defence",
            "date": "2025-11-21T04:29:54Z"
        },
        {
            "title": "Taiwan issues ‘crisis’ guide on preparing for disasters, Chinese attack",
            "summary": "Taiwan is distributing a crisis manual to its residents, preparing them for emergencies like natural disasters and potential invasion. This move reflects the island's heightened awareness of geopolitical tensions, especially with China. The manual aims to equip citizens with essential survival information, underscoring Taiwan's proactive approach to national resilience and defense preparedness.",
            "url": "https://www.digitaljournal.com/world/taiwan-issues-crisis-guide-on-preparing-for-disasters-chinese-attack/article",
            "category": "Defence",
            "date": "2025-11-21T04:27:20Z"
        },
        {
            "title": "Yankees fan goes viral for throwing visceral Aaron Judge and Gerrit Cole accusation at Brian Cashman",
            "summary": "A Yankees fan recently gained significant online attention after making a highly emotional and impactful accusation concerning star players Aaron Judge and Gerrit Cole. The fan directed these serious claims at Brian Cashman, the team's General Manager. This incident, reported by The Sporting News, quickly went viral across social media platforms.",
            "url": "https://www.sportingnews.com/us/mlb/new-york-yankees/news/yankees-fan-goes-viral-throwing-visceral-aaron-judge-gerrit-cole-accusation-brian-cashman/385c0c828eb1c1857495dcbb",
            "category": "National",
            "date": "2025-11-21T03:45:18Z"
        },
        {
            "title": "Familiar rival stands in Gotham FC’s way once again in their bid for NWSL title",
            "summary": "Spirit goalkeeper Aubrey Kingsbury recently reflected on last year's dramatic semifinals match against Gotham FC, calling it a 'great game.' Her reminiscence offers a glimpse into the intense competition and memorable moments of professional soccer, highlighting player perspectives on high-stakes contests within the National Women's Soccer League.",
            "url": "https://nypost.com/2025/11/20/sports/gotham-fc-must-go-through-rival-once-again-in-nwsl-championship/",
            "category": "National",
            "date": "2025-11-21T03:03:29Z"
        },
        {
            "title": "DRDO and DGA, France ink Technical Agreement to deepen collaboration in defence R&D",
            "summary": "The Ministry of Defence announced on November 20, 2025, that the Defence Research & Development Organisation (DRDO) has signed a significant Technical Agreement. This pact is crucial for advancing India's defence capabilities, focusing on collaborative research and development. It underscores ongoing strategic initiatives to bolster national security and achieve greater technological self-reliance within the country's defence sector, signaling future advancements.",
            "url": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-251120-india-pib01.htm",
            "category": "Defence",
            "date": "2025-11-21T02:54:14Z"
        },
        {
            "title": "2026 ZiPS Projections: Texas Rangers",
            "summary": "The provided text is a truncated code snippet, likely JavaScript, configuring a website navigation widget. It references 'currentSeason: 2026', 'previousSeason: 2025', and various 'termIds'. This content is not a news article and therefore cannot be meaningfully summarized for an SSB aspirant regarding current events, defence, national, or international affairs. It appears to be website technical data or configuration.",
            "url": "https://blogs.fangraphs.com/2026-zips-projections-texas-rangers/",
            "category": "Sci & Tech",
            "date": "2025-11-21T02:49:53Z"
        },
        {
            "title": "Japan's PM said the quiet part out loud and unleashed Beijing's fury",
            "summary": "China expresses wariness over Japan's potential new Prime Minister, Sanae Takaichi, known for her hawkish stance towards Beijing. Tensions escalated after Takaichi weighed in on the highly sensitive issue of Taiwan. This situation highlights increasing geopolitical friction and strategic realignments in the Indo-Pacific, underscoring the complexities of regional power dynamics relevant for future defence considerations.",
            "url": "https://www.abc.net.au/news/2025-11-21/the-china-japan-diplomatic-row/106031582",
            "category": "International",
            "date": "2025-11-21T02:10:14Z"
        },
        {
            "title": "Indian, Tanzania Navy officials discuss bilateral maritime engagements",
            "summary": "The maiden Indian Navy-Tanzania People's Defence Force Navy Staff Talks successfully concluded in Dar es Salaam, Tanzania. This landmark event strengthens naval cooperation and strategic partnership between the two nations. Such dialogues are vital for enhancing maritime security, fostering regional stability, and sharing best practices, underscoring India's growing defence diplomacy in the Indian Ocean.",
            "url": "https://economictimes.indiatimes.com/news/defence/indian-tanzania-navy-officials-discuss-bilateral-maritime-engagements/articleshow/125475175.cms",
            "category": "Defence",
            "date": "2025-11-21T01:52:16Z"
        },
        {
            "title": "Zelenskiy says he is ready to work on US-backed plan to end war in Ukraine",
            "summary": "Ukrainian President Zelenskiy met with a senior U.S. Army official, expressing readiness to collaborate with Washington on a comprehensive plan to end the conflict in Ukraine. He anticipates further discussions with the U.S. President on this peace initiative. This signals ongoing diplomatic efforts and military coordination between Ukraine and the United States amidst the prolonged war.",
            "url": "https://economictimes.indiatimes.com/news/defence/zelenskiy-says-he-is-ready-to-work-on-us-backed-plan-to-end-war-in-ukraine/articleshow/125474903.cms",
            "category": "International",
            "date": "2025-11-21T00:57:16Z"
        },
        {
            "title": "BREAKING: B-52s Swarm Venezuela! Maduro's Regime Is DOOMED",
            "summary": "Breaking reports indicate B-52 Stratofortress bombers are currently flying south. These strategic long-range aircraft of the U.S. Air Force are key assets for power projection and deterrence. While specific mission details remain undisclosed, such movements often signify military exercises, strategic posturing, or responses to geopolitical developments, crucial for an SSB aspirant's defence awareness.",
            "url": "https://freerepublic.com/focus/f-news/4353731/posts",
            "category": "Defence",
            "date": "2025-11-21T00:37:42Z"
        },
        {
            "title": "BREAKING: B-52s Swarm Venezuela! Maduro's Regime Is DOOMED",
            "summary": "Breaking news reports indicate B-52 Stratofortress bombers are currently flying south. While specific mission details are not provided in this report, the movement of strategic assets like B-52s often signals heightened military activity or exercises, important for SSB aspirants to monitor global defence developments and strategic shifts.",
            "url": "https://freerepublic.com/focus/f-bloggers/4353731/posts",
            "category": "Defence",
            "date": "2025-11-21T00:37:42Z"
        },
        {
            "title": "India set to reload as US clears ammo, missiles delivery",
            "summary": "The United States has approved the urgent sale of precision-guided munitions and anti-tank missiles to India. This clearance follows New Delhi's pressing request for these acquisitions in the aftermath of 'Operation Sindoor'. The deal significantly enhances India's defensive capabilities and strategic preparedness, underscoring the deepening defence cooperation between Washington and New Delhi amidst evolving regional security challenges.",
            "url": "https://economictimes.indiatimes.com/news/defence/india-set-to-reload-as-us-clears-ammo-missiles-delivery/articleshow/125471428.cms",
            "category": "Defence",
            "date": "2025-11-21T00:32:00Z"
        },
        {
            "title": "Updated Week 12 Fantasy RB Rankings PPR: Running back tiers and lineup tips on who to start, best sleepers, streamers",
            "summary": "This article presents updated Week 12 Fantasy Football RB Rankings for PPR leagues, offering running back tiers, lineup tips on who to start, and identifying best 'sleepers' and 'streamers'. It provides guidance for fantasy sports enthusiasts managing their teams, originally sourced from The Sporting News.",
            "url": "https://www.sportingnews.com/us/fantasy/news/fantasy-football-rb-rankings-week-12-2025/b2388887c5471b43464ff57f",
            "category": "National",
            "date": "2025-11-21T00:30:00Z"
        },
        {
            "title": "Russian Defence Minister Andrei Belousov holds talks with Vice Chairman of the Central Military Commission of the People's Republic of China General Zhang Youxia",
            "summary": "Nations commemorated the 80th anniversary of their common Victory over German fascism and Japanese militarism in 2025. The celebration underscored the critical importance of preserving historical truth and perpetuating the memory of this monumental triumph. This event highlights the collective remembrance of a pivotal moment in global history, emphasizing the enduring legacy and lessons learned from the conflict that shaped the modern world.",
            "url": "https://www.globalsecurity.org/wmd/library/news/russia/2025/11/russia-251120-russia-mod01.htm",
            "category": "International",
            "date": "2025-11-21T00:08:00Z"
        },
        {
            "title": "Private Assets in 401(k)s Add Modest Value: Morningstar",
            "summary": "The White House, alongside asset managers, is exploring avenues to integrate private market assets into Americans' defined contribution plans. This initiative seeks to broaden investment opportunities for citizens, though its universal benefit remains under discussion, with analysis suggesting it might be advantageous 'for some people, sometimes.' This ongoing policy debate concerns national economic strategy and individual financial planning.",
            "url": "https://www.thedailyupside.com/advisor/investing-strategies/private-assets-in-401ks-add-modest-value-morningstar/",
            "category": "National",
            "date": "2025-11-20T23:05:00Z"
        },
        {
            "title": "Why Lithium Americas Could Be a 2030 Power Play—Not a 2025 One",
            "summary": "Lithium Americas' Thacker Pass project, receiving considerable U.S. government funding, represents a long-term opportunity to boost domestic lithium production. Essential for lithium-ion batteries, this initiative aims to strengthen the U.S. supply chain for critical energy materials. While promising, significant output is expected gradually, reflecting a strategic, phased approach to resource development.",
            "url": "https://www.marketbeat.com/originals/why-lithium-americas-could-be-a-2030-power-playnot-a-2025-one/?utm_source=yahoofinance&amp;utm_medium=yahoofinance",
            "category": "Sci & Tech",
            "date": "2025-11-20T22:44:00Z"
        },
        {
            "title": "Fantasy Football 2025: Week 12 preview – Start/sit and more",
            "summary": "The fantasy league season is quickly progressing, with playoffs set to commence in Week 15 after only three remaining weeks. Week 11 notably marked one of the lowest-scoring periods of the season for participants. While this update concerns recreational gaming, it highlights trending activities within the national landscape, though less directly relevant for typical SSB preparations.",
            "url": "https://www.bigblueview.com/new-york-giants-analysis/145814/fantasy-football-2025-week-12-preview-start-sit-and-more",
            "category": "National",
            "date": "2025-11-20T22:30:00Z"
        },
        {
            "title": "Missing Endangered Person Alert issued for Wisconsin woman last seen in May 2025, concern for well-being",
            "summary": "Wisconsin officials issued a Missing Endangered Person Alert for a 42-year-old woman, last contacting family in May 2025. This alert signifies serious concerns for her safety, prompting law enforcement to seek public assistance. Such alerts highlight critical mechanisms for locating vulnerable individuals, underscoring their importance for national public safety.",
            "url": "https://www.wearegreenbay.com/news/local-news/missing-endangered-person-alert-issued-for-wisconsin-woman-last-seen-in-may-2025-concern-for-well-being/",
            "category": "National",
            "date": "2025-11-20T21:34:09Z"
        },
        {
            "title": "Tom Brady and Birmingham unveil plans for new 62,000-seater stadium",
            "summary": "Birmingham City FC has unveiled plans for an ambitious new 62,000-seat stadium in Bordesley Green, UK. This modern venue is central to a massive redevelopment project aimed at revitalizing the area. The initiative promises significant urban infrastructure development and potential economic uplift, marking a major investment in the region's future sports and community facilities.",
            "url": "https://www.101greatgoals.com/football/tom-brady-birmingham-unveil-plans-new-65000-seater-stadium/",
            "category": "National",
            "date": "2025-11-20T21:02:31Z"
        },
        {
            "title": "‘It makes Australia a target’: Wanning Sun on the realities of AUKUS",
            "summary": "A recent poll indicates strong Australian public support for the AUKUS nuclear submarine deal, despite critics' warnings about the significant cost and concerns regarding US stability. This backing aligns with consistent political endorsement for the pact, designed to equip Australia with nuclear-powered submarines. For SSB aspirants, this highlights major Indo-Pacific strategic cooperation and advanced defence capability building.",
            "url": "http://www.crikey.com.au/2025/11/21/aukus-australia-china-wanning-sun/",
            "category": "Defence",
            "date": "2025-11-20T20:53:06Z"
        },
        {
            "title": "NWSL Awards Presented By AT&T Celebrate Rising Stars And League Growth",
            "summary": "The 2025 NWSL Awards, presented by AT&T, are scheduled for November 19, 2025, in San Jose, California. Hosted by Jordan Angeli at the Montgomery Theater, this event will celebrate achievements within the National Women's Soccer League. It marks an annual recognition of excellence in professional women's football in the United States, highlighting key players and contributors.",
            "url": "https://www.forbes.com/sites/jennnelson/2025/11/20/nwsl-awards-presented-by-att-celebrate-rising-stars-and-league-growth/",
            "category": "International",
            "date": "2025-11-20T20:49:28Z"
        },
        {
            "title": "News 11/21/25",
            "summary": "Ruthia He, founder and CEO of the ADHD-prescribing telehealth platform Done, has been convicted on federal charges. These include illegally distributing Adderall, committing healthcare claims fraud, and conspiring to obstruct justice. This case underscores the rigorous regulatory scrutiny faced by telehealth companies, especially regarding controlled substance prescriptions, and highlights the legal accountability for executives in this evolving industry.",
            "url": "https://histalk2.com/2025/11/20/news-11-21-25/",
            "category": "National",
            "date": "2025-11-20T20:37:18Z"
        },
        {
            "title": "All 7 DCU Superheroes, Ranked By Threat Level",
            "summary": "James Gunn's DC Universe is in its nascent stage, currently featuring only three projects. Notably, two of these initial ventures focus on antagonists, indicating a strategic direction in establishing the new superhero franchise. This early emphasis on villains suggests a deliberate narrative choice, potentially aiming to differentiate the evolving cinematic universe and explore complex character dynamics from its very inception.",
            "url": "http://comicbook.com/movies/list/all-7-dcu-superheroes-ranked-by-threat-level/",
            "category": "International",
            "date": "2025-11-20T20:00:00Z"
        },
        {
            "title": "DC's Green Lantern show gets an official 2026 release window",
            "summary": "DC Studios is set to expand the Green Lantern universe beyond the introduction of Guy Gardner in Superman. Fans can anticipate meeting more members of the iconic Green Lantern Corps soon. These developments are tied to HBO Max, signaling upcoming content within the DC cinematic and television slate. This move aims to further develop one of DC's vaunted superhero teams.",
            "url": "https://www.gamesradar.com/entertainment/dc-tv-shows/dcs-green-lantern-show-gets-an-official-2026-release-window/",
            "category": "Sci & Tech",
            "date": "2025-11-20T19:20:00Z"
        },
        {
            "title": "How critical minerals power our daily lives from the moment we wake up",
            "summary": "This article underscores the indispensable role of critical minerals in the modern world, emphasizing that daily life is practically impossible without them. It highlights how every aspect, from household items to advanced technologies, deeply relies on these fundamental elements. This pervasive dependence underscores their crucial impact on contemporary society and human existence.",
            "url": "https://www.abc.net.au/news/2025-11-21/how-critical-minerals-rare-earths-are-used-in-everyday-life/105980350",
            "category": "Sci & Tech",
            "date": "2025-11-20T18:52:59Z"
        },
        {
            "title": "Dr Jitendra lauds Indian Army’s mega health camp; Performs Bhoomi Pujan of Udhampur Chamber of Commerce Building",
            "summary": "Union Minister Dr. Jitendra Singh commenced public engagements in Udhampur, notably visiting the Army Command Hospital. This highlights government interaction with defence establishments and public welfare. Dr. Singh likely addressed local issues, engaged with citizens, and reviewed development projects, underscoring the government's commitment to national security personnel and regional progress.",
            "url": "https://statetimes.in/dr-jitendra-lauds-indian-armys-mega-health-camp-performs-bhoomi-pujan-of-udhampur-chamber-of-commerce-building/",
            "category": "Defence",
            "date": "2025-11-20T18:45:06Z"
        },
        {
            "title": "Kashmir Times office in Jammu searched over alleged links to secessionist plot",
            "summary": "Authorities recently searched the Kashmir Times office in Jammu, investigating alleged links to a secessionist plot. This action underscores India's proactive stance against groups suspected of undermining national integrity and security. Such developments are crucial for SSB aspirants to understand regarding internal security challenges and the government's efforts to counter separatist activities within the region.",
            "url": "https://timesofindia.indiatimes.com/india/kashmir-times-office-in-jammu-searched-over-alleged-links-to-secessionist-plot/articleshow/125470404.cms",
            "category": "National",
            "date": "2025-11-20T18:45:03Z"
        },
        {
            "title": "Talk to Centre to stop harassment of Kashmiris across India, Mehbooba urges Omar",
            "summary": "Former J&K CM Mehbooba Mufti urged Omar Abdullah to engage with the central government to address reported harassment and profiling of Kashmiris nationwide. The plea highlights concerns over the safety and fair treatment of Kashmiri citizens across various parts of India. This emphasizes the need for federal intervention to ensure their protection and prevent discriminatory practices amidst ongoing tensions, underscoring issues of national integration and citizen rights.",
            "url": "https://timesofindia.indiatimes.com/india/talk-to-centre-to-stop-harassment-of-kashmiris-across-india-mehbooba-urges-omar/articleshow/125470136.cms",
            "category": "National",
            "date": "2025-11-20T18:39:29Z"
        },
        {
            "title": "Russia's alleged hybrid warfare targeting seafloor cables vital to modern life",
            "summary": "Over 95% of global internet and voice communication traffic relies on an extensive network of fiber optic cables laid across ocean floors. These critical undersea cables are the backbone of modern digital connectivity, essential for international communication and economies. Their vast reach underscores their strategic importance and potential vulnerabilities, demanding global attention for their security.",
            "url": "https://www.cbsnews.com/news/russia-alleged-hybrid-warfare-undersea-cables/",
            "category": "International",
            "date": "2025-11-20T18:35:26Z"
        },
        {
            "title": "DAVE THE DIVER now available for Xbox Series and Xbox One; physical edition announced for PS5 and Switch 2",
            "summary": "MINTROCKET has officially launched its single-player adventure RPG, \"DAVE THE DIVER,\" for the Xbox Series. The game is now accessible through the Microsoft Store for Xbox console users. Additionally, PC players can acquire the title via the Microsoft Store, expanding its availability across major gaming platforms, following its existing release on other platforms.",
            "url": "https://www.gematsu.com/2025/11/dave-the-diver-now-available-for-xbox-series-and-xbox-one-physical-edition-announced-for-ps5-and-switch-2",
            "category": "Sci & Tech",
            "date": "2025-11-20T18:05:37Z"
        },
        {
            "title": "Lanterns Release Date Window Delayed for DCU HBO TV Show",
            "summary": "The highly anticipated HBO Original drama series 'Lanterns,' developed by DC Studios, has officially had its release date postponed. The delay was announced during a press presentation by Casey Bloys, Chairman and CEO of HBO and HBO Max Content, confirming a setback for the upcoming superhero-themed production and its streaming schedule.",
            "url": "https://www.superherohype.com/tv/640178-lanterns-release-date-delayed-new-premiere-window-dcu-show",
            "category": "Sci & Tech",
            "date": "2025-11-20T18:03:21Z"
        },
        {
            "title": "Lanterns’ Schedule Push Might Be Good News For Fans of Cosmic DC",
            "summary": "Early buzz surrounding the upcoming 'Lanterns' series, based on the cosmic Green Lantern concept, has surprisingly focused entirely on terrestrial aspects. Despite the inherent cosmic nature of the source material, James Gunn's initial announcement and subsequent discussions indicate a grounded initial reception or narrative direction. This signals a potentially unique approach to adapting the iconic science fiction property for a new audience.",
            "url": "http://www.denofgeek.com/tv/lanterns-schedule-push-good-news-fans-cosmic-dc/",
            "category": "Sci & Tech",
            "date": "2025-11-20T18:00:00Z"
        },
        {
            "title": "Plans for Birmingham City's 62,000-seater stadium revealed",
            "summary": "Birmingham City Football Club, based in the West Midlands, has unveiled plans for a major new 62,000-capacity stadium. The club's ambitious goal is to have this state-of-the-art facility completed and ready for the start of the 2030/2031 football season. This significant infrastructure development highlights Birmingham City's long-term vision and investment in its sporting future.",
            "url": "https://www.bbc.com/news/articles/cly9y030r37o",
            "category": "International",
            "date": "2025-11-20T17:43:04Z"
        },
        {
            "title": "Brady, Bellingham hail Birmingham's new stadium",
            "summary": "Birmingham City Football Club has unveiled ambitious plans to construct a new 62,000-seat stadium. This significant development aims to propel the second-division club and the city onto a \"trajectory towards greatness,\" signifying a major infrastructure investment. Such projects highlight urban development and the economic impact of sports infrastructure, vital for understanding regional growth and planning.",
            "url": "https://www.espn.com/soccer/story/_/id/47037045/tom-brady-jude-bellingham-birmingham-city-new-stadium-unveiling",
            "category": "National",
            "date": "2025-11-20T17:42:06Z"
        }
    ]
}