{
    "last_updated": "2025-11-20T06:23:36.886226+00:00",
    "articles": [
        {
            "title": "INDIA-UK JOINT MILITARY TRAINING EXERCISE 'AJEYA WARRIOR-25' COMMENCES IN RAJASTHAN",
            "summary": "The eighth edition of the India-UK Joint Military Exercise \"AJEYA WARRIOR-25\" commenced on November 17, 2025. This bilateral drill is crucial for SSB aspirants to understand, as it focuses on enhancing interoperability, sharing best practices, and strengthening defence cooperation between the armed forces of India and the United Kingdom. Such exercises bolster strategic partnerships and regional security.",
            "url": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-251117-india-pib02.htm",
            "category": "Defence",
            "date": "2025-11-19T05:55:58Z"
        },
        {
            "title": "CURTAIN RAISER OF CHANAKYA DEFENCE DIALOGUE 2025 HELD IN NEW DELHI",
            "summary": "The Ministry of Defence announced that the Indian Army, in collaboration with the Centre for Land Warfare Studies (CLAWS), conducted an event. While specific details are truncated, this initiative likely focused on crucial aspects of land warfare, strategic analysis, or defence preparedness. Such collaborations are vital for enhancing the Army's intellectual capital and adapting to evolving security challenges, demonstrating a commitment to advanced defence thinking.",
            "url": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-251117-india-pib03.htm",
            "category": "Defence",
            "date": "2025-11-19T05:55:16Z"
        },
        {
            "title": "Russia says Ukraine fired US-made ATACMS missiles at Voronezh",
            "summary": "Russia's defence ministry reported that Ukrainian forces launched four U.S.-made ATACMS missiles targeting the southern Russian city of Voronezh. Moscow claims this was an attempted strike on civilian infrastructure. This incident highlights the escalating use of advanced weaponry in the ongoing conflict, with Russia accusing Ukraine of targeting non-military sites using Western-supplied armaments, intensifying the war's scope.",
            "url": "https://economictimes.indiatimes.com/news/defence/russia-says-ukraine-fired-us-made-atacms-missiles-at-voronezh/articleshow/125428177.cms",
            "category": "Defence",
            "date": "2025-11-19T05:39:38Z"
        },
        {
            "title": "Global risk-off sentiment keeping Indian markets in sluggish mode: Dharmesh Kant",
            "summary": "Indian markets are exhibiting cautious trading, driven by a global risk-off sentiment originating from corrections in US equities. This trend is impacting diverse assets, from cryptocurrencies like Bitcoin to traditional safe havens such as precious metals. Investors are closely monitoring these international economic uncertainties as they trickle down, influencing domestic market behaviour and investment decisions within India.",
            "url": "https://economictimes.indiatimes.com/markets/expert-view/global-risk-off-sentiment-keeping-indian-markets-in-sluggish-mode-dharmesh-kant/articleshow/125427233.cms",
            "category": "National",
            "date": "2025-11-19T04:48:47Z"
        },
        {
            "title": "Air India lobbies to use airspace over China's Xinjiang as financial woes mount",
            "summary": "Air India is lobbying the Indian government to secure permission from China to use a sensitive military airspace zone in Xinjiang. This move aims to significantly shorten flight routes and alleviate the substantial financial strain currently faced by the airline due to existing restrictions on Indian carriers. The effort underscores the commercial pressures and diplomatic engagement required to optimize international air travel amid geopolitical sensitivities.",
            "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/air-india-lobbies-to-use-airspace-over-chinas-xinjiang-as-financial-woes-mount/articleshow/125426787.cms",
            "category": "International",
            "date": "2025-11-19T04:22:21Z"
        },
        {
            "title": "The Asian century rolls on as Trump risks freezing America out",
            "summary": "President Trump's efforts to revive American economic supremacy, reminiscent of the 20th century, risk isolating the U.S. from Asia, which is asserting its economic leadership in the 21st century. This strategy, focused on past dominance, could strain crucial trade relationships and potentially alienate America from vital global partners, signaling a shift in international power dynamics and economic focus.",
            "url": "https://economictimes.indiatimes.com/news/international/global-trends/the-asian-century-rolls-on-as-trump-risks-freezing-america-out/articleshow/125424820.cms",
            "category": "International",
            "date": "2025-11-19T02:12:36Z"
        },
        {
            "title": "Vietnamese Food Restaurants Your Pho Cravings Deserve",
            "summary": "The text describes the common experience of watching a TikTok video of someone enjoying a hot bowl of pho with fresh herbs and spring rolls, triggering an immediate craving. This highlights how social media powerfully influences culinary desires, exposing viewers to diverse international cuisines. It demonstrates the pervasive impact of digital trends on personal preferences and food choices, shaping consumer interests.",
            "url": "https://www.dumblittleman.com/vietnamese-food-restaurants/",
            "category": "International",
            "date": "2025-11-19T01:48:11Z"
        },
        {
            "title": "Raksha Rajya Mantri chairs Industry Roundtable on Day-2 of his Dubai visit",
            "summary": "India's Ministry of Defence is actively encouraging global and Indian firms to explore joint ventures and collaborative opportunities within the country. This initiative aims to foster partnerships, leverage emerging prospects, and bolster India's defence industrial ecosystem. It signifies a strategic push to enhance indigenous capabilities and manufacturing through synergistic efforts with both international and national players in the defence sector.",
            "url": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-251118-india-pib02.htm",
            "category": "Defence",
            "date": "2025-11-19T01:34:51Z"
        },
        {
            "title": "Stock Market Highlights 19 Nov 2025: Stock markets rebound on buying in IT counter; Sensex jumps over 513 points, NIfty 50 climbed 142.60 points to 26,052.65",
            "summary": "The Indian Rupee concluded trading with a slight gain, appreciating by 2 paise against the US dollar to settle at 88.58. This movement in the foreign exchange market is a key economic indicator, reflecting India's financial health and trade dynamics. For SSB aspirants, tracking such national economic performance is vital for understanding India's stability and global economic position.",
            "url": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-19-november-2025/article70294642.ece",
            "category": "National",
            "date": "2025-11-19T01:02:48Z"
        },
        {
            "title": "Taste the season—Europe's best Christmas market foods and where to eat them",
            "summary": "This National Geographic Traveller (UK) article highlights the annual emergence of numerous 'pop-up wonderlands' across the continent at the start of Advent. These festive attractions, likely seasonal markets or cultural events, offer unique experiences. The piece presumably details various international destinations and their unique celebrations, focusing on tourism and cultural exploration during the winter holiday period.",
            "url": "https://www.nationalgeographic.com/travel/article/europes-best-christmas-market-treats-and-where-to-eat-them",
            "category": "International",
            "date": "2025-11-19T00:00:00Z"
        },
        {
            "title": "Reduced plasma levels of Copine 5 correlate with sepsis-induced vascular leakage and mortality in human patients and a murine sepsis model",
            "summary": "This research utilizes single-nucleus expression profiling to analyze Copine family genes within human aorta endothelial cells (ECs). ECs line blood vessels and serve as primary responders to pathogens. Investigating these genes' expression patterns in ECs can provide vital insights into vascular health, immune responses, and disease mechanisms, contributing to advanced biomedical understanding.",
            "url": "https://ccforum.biomedcentral.com/articles/10.1186/s13054-025-05711-1",
            "category": "Sci & Tech",
            "date": "2025-11-19T00:00:00Z"
        },
        {
            "title": "Tumour-reactive heterotypic CD8 T cell clusters from clinical samples",
            "summary": "Human cancer cell lines from the Peeper lab were meticulously prepared for *in vitro* experiments. Identity was confirmed via short-tandem-repeat profiling, and they tested negative for mycoplasma. This rigorous quality control ensures the reliability and integrity of these cellular models, forming a foundational step for robust scientific research into cancer mechanisms and potential therapeutic advancements.",
            "url": "https://www.nature.com/articles/s41586-025-09754-w",
            "category": "Sci & Tech",
            "date": "2025-11-19T00:00:00Z"
        }
    ]
}