{
    "last_updated": "2025-11-23T01:22:07.113190+00:00",
    "articles": [
        {
            "title": "Watch: New Submarine-Hunting Underwater Drones Undergo Tests in Baltic Sea",
            "summary": "New German-developed GreyShark underwater drones are undergoing testing in the Baltic Sea. These advanced drones are designed to detect hard-to-find submarines and protect critical undersea cables from potential threats. Their deployment aims to significantly enhance maritime security and surveillance capabilities in strategic waters.",
            "url": "https://biztoc.com/x/314108732234313b",
            "category": "Defence",
            "date": "2025-11-22T01:13:12Z"
        },
        {
            "title": "Russia says it has taken string of east Ukrainian villages",
            "summary": "Russia's Defence Ministry recently announced its forces captured several frontline settlements in eastern Ukraine. However, Kyiv has either denied these claims or not acknowledged them. This highlights the ongoing, contested nature of the conflict and the information warfare inherent in the protracted war, crucial for understanding current international defence dynamics.",
            "url": "https://www.thestar.com.my/news/world/2025/11/22/russia-says-it-has-taken-string-of-east-ukrainian-villages",
            "category": "Defence",
            "date": "2025-11-22T01:01:00Z"
        },
        {
            "title": "Rs 10k crore: Cost of health cover fraud",
            "summary": "A BCG-Medi Assist report reveals India's health insurance system loses ₹8,000-10,000 crore annually to fraud and waste. This substantial financial drain impacts premiums and public funds, highlighting critical inefficiencies. Addressing vulnerabilities, especially in reimbursement claims, is crucial for strengthening national healthcare financing and ensuring sustainable access to medical services across the country. Such systemic issues require robust governance and oversight.",
            "url": "https://timesofindia.indiatimes.com/india/rs-10k-crore-cost-of-health-cover-fraud/articleshow/125497230.cms",
            "category": "National",
            "date": "2025-11-21T23:23:48Z"
        },
        {
            "title": "SC: Accused has right to speedy investigation",
            "summary": "The Supreme Court affirmed that the right to a speedy investigation is a fundamental right, ensuring accused individuals are not subjected to endless suffering from prolonged probes. This landmark ruling emphasizes judicial efficiency and protection against undue state power, highlighting the importance of timely justice within India's legal framework for all citizens.",
            "url": "https://timesofindia.indiatimes.com/india/sc-accused-has-right-to-speedy-investigation/articleshow/125497152.cms",
            "category": "National",
            "date": "2025-11-21T22:55:39Z"
        },
        {
            "title": "Bihar: Nitish Kumar cedes home to BJP's dy CM, JDU takes finance",
            "summary": "Bihar CM Nitish Kumar has allocated the crucial Home portfolio to BJP's Deputy CM Samrat Choudhary, indicating a significant power-sharing arrangement. Nitish's JDU party has taken charge of the Finance ministry in this key reshuffle. This development highlights the political dynamics and portfolio distribution within the Bihar state government, essential for SSB aspirants following national current affairs.",
            "url": "https://timesofindia.indiatimes.com/india/bihar-nitish-kumar-cedes-home-to-bjps-dy-cm-jdu-takes-finance/articleshow/125496890.cms",
            "category": "National",
            "date": "2025-11-21T22:41:25Z"
        },
        {
            "title": "£4bn maritime deal with Indonesia set to boost British jobs and support Indo-Pacific security",
            "summary": "A new strategic partnership between the UK and Indonesia will secure 1000 British jobs across Rosyth, Bristol, and Plymouth. This deal signifies both nations' shared commitment to stability and prosperity, strengthening international cooperation. It bolsters the UK's industrial base and global defence connections, hinting at future collaborative projects crucial for economic growth and strategic influence.",
            "url": "https://www.gov.uk/government/news/4bn-maritime-deal-with-indonesia-set-to-boost-british-jobs-and-support-indo-pacific-security",
            "category": "Defence",
            "date": "2025-11-21T22:30:08Z"
        },
        {
            "title": "IAF pilot dies as Tejas fighter crashes at Dubai air show",
            "summary": "An Indian Air Force (IAF) Tejas fighter jet tragically crashed during a demonstration at the Dubai Airshow, resulting in the unfortunate demise of the pilot. This incident involves India's indigenous light combat aircraft and is expected to trigger a detailed investigation into the cause, potentially impacting future international showcases of the Tejas.",
            "url": "https://timesofindia.indiatimes.com/india/iaf-pilot-dies-as-tejas-fighter-crashes-at-dubai-air-show/articleshow/125496211.cms",
            "category": "Defence",
            "date": "2025-11-21T22:24:38Z"
        },
        {
            "title": "Order against ‘bulldozer justice’ was my most important: CJI Gavai",
            "summary": "Retiring Chief Justice of India B.R. Gavai underscored his judgment against \"bulldozer justice\" as his most significant. This ruling addresses the controversial practice of arbitrary demolitions by authorities, often without adherence to proper legal procedures. His emphasis highlights the judiciary's crucial role in safeguarding the rule of law and citizens' rights against summary actions, reinforcing constitutional principles within India.",
            "url": "https://timesofindia.indiatimes.com/india/order-against-bulldozer-justice-was-my-most-important-cji-gavai/articleshow/125495363.cms",
            "category": "National",
            "date": "2025-11-21T22:09:00Z"
        },
        {
            "title": "Pilot killed in Indian fighter jet crash during demo flight at Dubai Air Show",
            "summary": "An Indian Air Force pilot tragically died after a HAL Tejas combat aircraft crashed during a demonstration flight at the Dubai Air Show. The incident, confirmed by the IAF, occurred in front of spectators at the international event. This unfortunate loss highlights the inherent risks in military aviation and air displays, even for advanced indigenous aircraft like the Tejas, drawing attention to safety protocols.",
            "url": "https://www.abc.net.au/news/2025-11-22/pilot-killed-in-indian-fighter-jet-crash/106039602",
            "category": "Defence",
            "date": "2025-11-21T22:03:41Z"
        },
        {
            "title": "Minimum wage to social security, labour reforms set for rollout",
            "summary": "India is set to roll out major labour reforms, consolidating 29 existing laws into four new codes covering minimum wage, social security, and other worker welfare aspects. Rules for these significant changes are expected within 45 days, aiming to modernize industrial relations and streamline regulations for better worker protection and economic efficiency nationwide.",
            "url": "https://timesofindia.indiatimes.com/india/minimum-wage-to-social-security-labour-reforms-set-for-rollout/articleshow/125495028.cms",
            "category": "National",
            "date": "2025-11-21T22:03:03Z"
        },
        {
            "title": "Pilot killed after Indian fighter jet crashes at Dubai Air Show - The Independent",
            "summary": "This 'fine print' disclaimer clarifies a standard online policy: platforms disclaim responsibility for user-posted comments, attributing ownership and liability to the original poster. For SSB aspirants, this emphasizes the critical need to understand digital terms of service and uphold personal accountability for online content, promoting digital literacy and ethical conduct in all virtual interactions.",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=180172767",
            "category": "Sci & Tech",
            "date": "2025-11-21T21:52:32Z"
        },
        {
            "title": "Bomb threats at Fond du Lac High School, health care center prompt police response",
            "summary": "Fond du Lac, Wisconsin police responded to identical, simultaneous bomb threats at two distinct locations on Friday afternoon, just before 1:45 p.m. This incident prompted an immediate law enforcement response to ensure public safety and manage the potential crisis. Such events underscore the constant vigilance required from security agencies and emergency services in handling public threats.",
            "url": "https://www.wbay.com/2025/11/21/bomb-threats-fond-du-lac-high-school-health-care-center-prompt-police-response/",
            "category": "International",
            "date": "2025-11-21T21:36:15Z"
        },
        {
            "title": "Now, BJP uses Indira peace prize as ammo to target Congress",
            "summary": "The BJP has attacked the Congress party, criticizing its decision to award the Indira Gandhi Peace Prize to a former recipient. The ruling party is using this award as political ammunition to target the Congress, suggesting controversy or impropriety in the selection process. This move highlights ongoing political rivalry and strategic criticism between India's major parties.",
            "url": "https://timesofindia.indiatimes.com/india/now-bjp-uses-indira-peace-prize-as-ammo-to-target-congress/articleshow/125494785.cms",
            "category": "National",
            "date": "2025-11-21T21:21:25Z"
        }
    ]
}