{
    "last_updated": "2025-11-18T20:02:37.628050+00:00",
    "articles": [
        {
            "title": "The US Air Force's new strategic bomber and ICBM got more money — almost $1 billion —in the government shutdown deal",
            "summary": "The advanced B-21 Raider stealth bomber is undergoing rigorous flight testing at Edwards Air Force Base, California. This includes ground testing, taxiing, and operational flights. As a next-generation long-range strategic bomber, the B-21 is vital for modernizing air power and enhancing strategic deterrence, representing a significant leap in military aviation technology.",
            "url": "https://www.businessinsider.com/air-forces-new-bomber-icbm-got-more-money-shutdown-deal-2025-11",
            "category": "Defence",
            "date": "2025-11-17T19:59:28Z"
        },
        {
            "title": "Early NBA All-Star picks: How Team U.S. and Team World rosters could look",
            "summary": "The NBA season is roughly a month in, proving to be wild, wacky, and entertaining. Key highlights include dominance from teams like Oklahoma City, a star-studded MVP race, and intriguing rookie performances, offering a blend of fun for basketball enthusiasts. The initial phase sets the stage for a competitive and engaging season.",
            "url": "https://sports.yahoo.com/nba/article/early-nba-all-star-picks-how-team-us-and-team-world-rosters-could-look-195455256.html",
            "category": "International",
            "date": "2025-11-17T19:54:55Z"
        },
        {
            "title": "Chandrayaan-4 mission likely to be launched in 2028, says Isro chief",
            "summary": "ISRO Chief announced India's Chandrayaan-4 lunar sample-return mission is slated for a 2028 launch. This ambitious project aims to bring lunar samples back to Earth, showcasing India's advanced capabilities in space exploration. Such complex missions are crucial for scientific research and enhance India's global standing in space technology, inspiring future generations in science and engineering.",
            "url": "https://timesofindia.indiatimes.com/india/chandrayaan-4-mission-likely-to-be-launched-in-2028-says-isro-chief/articleshow/125393792.cms",
            "category": "Sci & Tech",
            "date": "2025-11-17T19:04:44Z"
        },
        {
            "title": "The scary implications of the world’s first AI-orchestrated cyberattack",
            "summary": "A nuclear-armed intercontinental ballistic missile (ICBM) launched from Russia would take approximately 30 minutes to reach the United States. Submarine-launched missiles could potentially reduce this travel time even further. This underscores the rapid response window in modern nuclear warfare, a critical factor for strategic defence planning and international security dynamics, emphasizing the importance of deterrence.",
            "url": "https://biztoc.com/x/7ccb6c845d9cf94b",
            "category": "Defence",
            "date": "2025-11-17T18:32:35Z"
        },
        {
            "title": "Fantasy Basketball Week 5 Start/Sit Lineup Decisions: Kris Dunn may be a sneaky gamble with upside",
            "summary": "The NBA is facing another busy week with a packed schedule. In a significant team development, the New Orleans franchise has decided to move on from coach Willie Green. James Borrego has been promoted to the role of interim coach, taking the reins amidst the ongoing season. This coaching change is a key update for the team's immediate future.",
            "url": "https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-week-5-startsit-lineup-decisions-kris-dunn-may-be-a-sneaky-gamble-with-upside/",
            "category": "National",
            "date": "2025-11-17T18:30:09Z"
        },
        {
            "title": "The scary implications of the world’s first AI-orchestrated cyberattack",
            "summary": "A nuclear-armed intercontinental ballistic missile (ICBM) launched from Russia could reach the United States in approximately 30 minutes. Submarine launches could drastically reduce this travel time, offering even less warning. This highlights the critical importance of rapid detection and response protocols in modern strategic defense, a key consideration for national security and international stability.",
            "url": "https://www.vox.com/politics/468720/nuclear-ai-command-control",
            "category": "Defence",
            "date": "2025-11-17T18:23:51Z"
        },
        {
            "title": "Introducing F# 10",
            "summary": "F# 10, a modern functional programming language, is now available, shipping with the latest .NET 10 framework and Visual Studio 2026. This release focuses on refinement, aiming to enhance clarity, consistency, and overall performance for developers. It introduces a series of small but meaningful improvements designed to streamline the coding experience and boost efficiency.",
            "url": "https://devblogs.microsoft.com/dotnet/introducing-fsharp-10/",
            "category": "Sci & Tech",
            "date": "2025-11-17T18:05:00Z"
        },
        {
            "title": "Ringo Starr announces spring 2026 tour. Get tickets today",
            "summary": "The New York Post has officially partnered with Vivid Seats as its ticketing provider. This collaboration enables the Post to generate revenue through content sharing and user purchases, with featured pricing subject to change. This business arrangement aims to enhance ticketing services for readers while creating a new revenue stream for the publication.",
            "url": "https://nypost.com/2025/11/17/ticket-sales/ringo-starr-tour-2026-where-to-buy-tickets-schedule-dates/",
            "category": "National",
            "date": "2025-11-17T18:03:32Z"
        },
        {
            "title": "Inside billionaire Gabe Newell’s new $500 million superyacht, which has a submarine garage and its own hospital",
            "summary": "Gabe Newell's company, Valve, renowned for its Steam PC gaming platform, recently unveiled three new hardware products. This announcement signifies notable innovation within the tech and gaming sectors, showcasing advancements in consumer electronics and digital entertainment. For SSB aspirants, such developments underscore the rapid progress in technology, global market trends, and entrepreneurial ventures in the digital economy.",
            "url": "https://biztoc.com/x/c7b967b335c7477d",
            "category": "Sci & Tech",
            "date": "2025-11-17T17:36:24Z"
        },
        {
            "title": "Pierce Brosnan says he's heard his Black Adam character is \"going to have his own show, or his own movie\" and is \"going to be in the next Superman\"",
            "summary": "Actor Pierce Brosnan is reportedly considering a return to comic book movies following his 2022 DCEU debut in 'Black Adam'. The future of the 'Black Adam' franchise appeared uncertain after significant leadership changes involving James Gunn and Peter Safran. Brosnan's potential re-entry signals new developments within the evolving superhero film industry.",
            "url": "https://www.gamesradar.com/entertainment/dc-movies/pierce-brosnan-says-hes-heard-his-black-adam-character-is-going-to-have-his-own-show-or-his-own-movie-and-is-going-to-be-in-the-next-superman/",
            "category": "International",
            "date": "2025-11-17T17:27:17Z"
        },
        {
            "title": "Inside billionaire Gabe Newell’s new $500 million superyacht, which has a submarine garage and its own hospital",
            "summary": "Gabe Newell, co-founder of Valve Corporation, acquired Dutch shipyard Oceanco for an undisclosed sum. This move followed his close collaboration with Oceanco on building and designing his yacht, \"Leviathan.\" The purchase reflects a major tech figure's significant investment in luxury shipbuilding, potentially indicating an expanding interest beyond software into large-scale engineering projects.",
            "url": "https://fortune.com/2025/11/17/gabe-newell-leviathan-superyacht-features-submarine-garage-hospital-spa-gaming-pcs-inkfish-oceanco/",
            "category": "Sci & Tech",
            "date": "2025-11-17T17:19:40Z"
        },
        {
            "title": "Betty Gilpin Joins Ron Howard’s Amazon MGM Military Drama ‘Alone At Dawn’",
            "summary": "Betty Gilpin has joined Adam Driver and Anne Hathaway in Ron Howard's upcoming Amazon MGM military drama, \"Alone at Dawn.\" Based on a 2019 book, the film delves into military themes, offering a cinematic perspective on service life. This high-profile production, featuring a strong cast and renowned director, provides valuable insight into defence narratives for SSB aspirants.",
            "url": "http://deadline.com/2025/11/alone-at-dawn-casts-betty-gilpin-amazon-mgm-1236620312/",
            "category": "Defence",
            "date": "2025-11-17T17:15:55Z"
        },
        {
            "title": "DA Alvin Bragg Releases Migrant Taxi Driver Charged for Repeatedly Assaulting Female Passengers",
            "summary": "Manhattan District Attorney Alvin Bragg reportedly released a migrant taxi driver who had been charged with repeatedly assaulting female passengers. This decision, occurring in November 2025, has potentially sparked debate regarding public safety, the legal system's approach to such grave accusations, and the handling of repeat offenders within the migrant community.",
            "url": "https://freerepublic.com/focus/f-news/4353009/posts",
            "category": "National",
            "date": "2025-11-17T17:15:26Z"
        },
        {
            "title": "Financial Firm GFI Group Expands to 129K SF at 55 Water Street",
            "summary": "Financial services firm GFI Group is significantly expanding its office presence in Manhattan's Financial District. The company is doubling its footprint by adding 64,993 square feet on the 11th floor of 55 W, bringing its total space to 128,749 square feet. This expansion underscores growth in the financial sector in a major US business hub.",
            "url": "http://commercialobserver.com/2025/11/gfi-group-lease-expansion-55-water-street/",
            "category": "National",
            "date": "2025-11-17T15:58:43Z"
        },
        {
            "title": "The US Military Just Launched An Unarmed Nuclear Missile - Here's Why",
            "summary": "A recent unarmed missile test flight from California precisely mirrored a launch from May 2025, following the same schedule and flight path. This consistent pattern indicates ongoing evaluations of missile systems, likely for strategic defense readiness. Such test flights are crucial for verifying technical capabilities and ensuring national security protocols, providing valuable data for military preparedness.",
            "url": "https://www.bgr.com/2023446/why-us-military-launched-unarmed-nuclear-missile-vandenberg/",
            "category": "Defence",
            "date": "2025-11-17T15:47:00Z"
        },
        {
            "title": "GA-ASI and Saab Will Test MQ-9B AEW&C Variant in the Summer of 2026",
            "summary": "General Atomics Aeronautical Systems (GA-ASI) is testing a new podded Airborne Early Warning and Control (AEW&C) capability for its MQ-9B Remotely Piloted Aircraft. This development significantly enhances the MQ-9B's role beyond surveillance, allowing drones to perform critical early detection and air control functions. Such advancements are pivotal for modern aerial reconnaissance and future defence strategies, offering increased operational flexibility and situational awareness.",
            "url": "https://theaviationist.com/2025/11/17/mq-9b-aewc-test-summer-2026/",
            "category": "Defence",
            "date": "2025-11-17T15:31:35Z"
        },
        {
            "title": "Abraxas Power Corp. Granted Environmental Permit and Commences Coastal Works and Land Reclamation for Project Solar City, the First SEZ Development in the Maldives",
            "summary": "Abraxas Power Corp. has commenced work on its 100 MW floating-solar project, following environmental approval. The initial phase involves crucial land reclamation activities, marking a significant step in developing this large-scale renewable energy facility. This project will bolster national energy capacity, promote sustainable power generation, and contribute to the country's green energy transition, reflecting progress in infrastructure development.",
            "url": "https://financialpost.com/globe-newswire/abraxas-power-corp-granted-environmental-permit-and-commences-coastal-works-and-land-reclamation-for-project-solar-city-the-first-sez-development-in-the-maldives",
            "category": "National",
            "date": "2025-11-17T15:17:04Z"
        },
        {
            "title": "Yankees Predicted To Land Superstar Slugger With $360 Million Blockbuster",
            "summary": "Yankees principal owner Hal Steinbrenner convened a press conference at Yankee Stadium in Bronx, New York, on December 21, 2022. This event saw Steinbrenner addressing the media, a routine engagement for major sports franchise leadership to communicate updates, strategic decisions, or upcoming plans concerning the team's operations, performance, and future outlook to fans and stakeholders.",
            "url": "https://www.forbes.com/sites/peterchawaga/2025/11/17/yankees-predicted-to-land-superstar-slugger-with-360-million-blockbuster/",
            "category": "National",
            "date": "2025-11-17T15:16:23Z"
        },
        {
            "title": "Abraxas Power Corp. Granted Environmental Permit and Commences Coastal Works and Land Reclamation for Project Solar City, the First SEZ Development in the Maldives",
            "summary": "Abraxas Power Corp. has officially commenced mobilization, coastal works, and land reclamation activities in Male, Maldives. This development signals the beginning of a significant project by the company within the island nation. Such international infrastructure initiatives are important for SSB aspirants to note, as they often reflect foreign investment and regional development trends.",
            "url": "https://www.globenewswire.com/news-release/2025/11/17/3189322/0/en/Abraxas-Power-Corp-Granted-Environmental-Permit-and-Commences-Coastal-Works-and-Land-Reclamation-for-Project-Solar-City-the-First-SEZ-Development-in-the-Maldives.html",
            "category": "International",
            "date": "2025-11-17T15:15:00Z"
        },
        {
            "title": "Malayalam’s first action hero did over 100 films in 6 years; died performing dangerous stunt hanging from a helicopter",
            "summary": "Malayalam cinema, since its inception, has been deeply intertwined with Kerala's socio-political realities, predominantly depicting the stories of common people, albeit dramatized. This strong societal anchoring offers aspirants valuable insight into regional cultural narratives and socio-economic dynamics, highlighting how art reflects and influences community understanding and national identity.",
            "url": "https://indianexpress.com/article/entertainment/malayalam/jayan-did-over-100-films-in-6-years-died-performing-dangerous-stunt-hanging-from-a-helicopter-10370762/",
            "category": "National",
            "date": "2025-11-17T15:05:15Z"
        },
        {
            "title": "Warren Beatty and Carrie Fisher, Then 17, Take a Break During Filming of the Movie “Shampoo” (1975)",
            "summary": "The 1975 American comedy film 'Shampoo,' directed by Hal Ashby, showcased a prominent cast including Warren Beatty, who also co-wrote the screenplay. It starred acclaimed actors Julie Christie, Goldie Hawn, Lee Grant, Jack Warden, Tony Bill, and a young Carrie Fisher. This notable cinematic work brought together significant talent, marking a celebrated release in American film history from the mid-1970s.",
            "url": "https://www.vintag.es/2025/11/warren-beatty-carrie-fisher.html",
            "category": "National",
            "date": "2025-11-17T14:32:00Z"
        },
        {
            "title": "Here’s Why Aristotle Atlantic’s Core Equity Strategy Sold Halliburton Company (HAL)",
            "summary": "Aristotle Atlantic Partners, an investment advisor, has released its Core Equity Strategy third-quarter 2025 investor letter. This comprehensive document offers stakeholders a detailed market review, outlines the firm's quarterly performance, and includes critical financial insights. Such reports are vital for understanding economic trends and corporate strategies, providing aspirants valuable context on national financial health and investment dynamics.",
            "url": "https://biztoc.com/x/df0c25e7e6e697b3",
            "category": "National",
            "date": "2025-11-17T14:26:47Z"
        },
        {
            "title": "Paras Defence wins ₹71.68 cr DRDO order for submarine optronic periscopes",
            "summary": "Paras Defence and Space Technologies has secured a substantial ₹71.68 crore order from the DRDO for the supply of two Optronic Periscopes. This contract underscores India's strengthening indigenous defence manufacturing capabilities and the critical role of private sector contributions to national security. For SSB aspirants, such developments highlight robust career opportunities within defence R&D and production, enhancing self-reliance in strategic technologies.",
            "url": "https://www.thehindubusinessline.com/economy/logistics/paras-defence-wins-7168-cr-drdo-order-for-submarine-optronic-periscopes/article70291009.ece",
            "category": "Defence",
            "date": "2025-11-17T14:12:15Z"
        },
        {
            "title": "Here’s Why Aristotle Atlantic’s Core Equity Strategy Sold Halliburton Company (HAL)",
            "summary": "Aristotle Atlantic Partners, an investment advisor, has released its Core Equity Strategy investor letter for the third quarter of 2025. This letter provides a comprehensive market review and details the firm's quarterly performance and strategic achievements. It serves as an essential update for investors, offering insights into the company's financial health, investment outlook, and strategy execution during the specified period.",
            "url": "https://finance.yahoo.com/news/why-aristotle-atlantic-core-equity-140820205.html",
            "category": "National",
            "date": "2025-11-17T14:08:20Z"
        },
        {
            "title": "India–China relations improved at LAC since last October, says Army Chief",
            "summary": "COAS General Upendra Dwivedi recently stated that India-China relations have significantly improved since October last year. He attributed this positive development to sustained bilateral dialogue. This indicates a positive shift in diplomatic efforts concerning the border dispute and broader ties, crucial for regional stability and India's strategic interests.",
            "url": "https://www.thehindubusinessline.com/news/world/indiachina-relations-improved-at-lac-since-last-october-says-army-chief/article70290929.ece",
            "category": "Defence",
            "date": "2025-11-17T13:56:46Z"
        },
        {
            "title": "How India’s experience reflects on women’s evolving role in peacekeeping",
            "summary": "The Indian Army plans to induct women soldiers into its Territorial Army (TA) battalions, a significant first-of-its-kind move. This initiative aims to substantially expand opportunities for women within the armed forces, integrating them into the citizens' volunteer army. This progressive step underscores the commitment to gender equality and broader inclusivity in India's defence sector, opening new avenues for national service.",
            "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/how-indias-experience-reflects-on-womens-evolving-role-in-peacekeeping-10370983/",
            "category": "Defence",
            "date": "2025-11-17T13:34:08Z"
        },
        {
            "title": "EXC: Nuclear Defence Agency Hosting ‘Let’s Talk Inclusion’ Events While Subs Crumble",
            "summary": "The UK agency managing its nuclear submarine fleet is actively conducting 'Let’s Talk Inclusion' events and mandatory equality training. This focus on diversity and inclusion within a vital defence entity could prompt SSB aspirants to consider the strategic balance between core operational duties and internal HR initiatives, reflecting broader organizational management challenges.",
            "url": "https://order-order.com/2025/11/17/exc-nuclear-defence-agency-hosting-lets-talk-inclusion-events-while-subs-crumble/",
            "category": "Defence",
            "date": "2025-11-17T13:15:40Z"
        },
        {
            "title": "India-UK military exercise 'Ajeya Warrior-25' begins in Rajasthan",
            "summary": "The 8th India-UK joint military exercise, 'Ajeya Warrior-25', commenced at Mahajan field firing ranges in Rajasthan. This significant drill, conducted under a United Nations mandate, focuses on enhancing interoperability and counter-terrorism skills between both armies. It strengthens defence cooperation, promoting strategic ties and readiness for complex global security challenges, crucial for SSB aspirants to understand international military engagements.",
            "url": "https://economictimes.indiatimes.com/news/defence/india-uk-military-exercise-ajeya-warrior-25-begins-in-rajasthan/articleshow/125386609.cms",
            "category": "Defence",
            "date": "2025-11-17T13:10:21Z"
        },
        {
            "title": "Can a Buried Time Capsule Beat Earth’s Geology and Deep Time?",
            "summary": "This article, a collaboration with Forbes, delves into the concept of time capsules. It explores their significance in preserving vital information and cultural artifacts for future generations. The piece examines strategies for ensuring data longevity and intelligibility, facilitating communication across centuries to inform and connect with those yet to come.",
            "url": "https://www.scientificamerican.com/article/can-a-buried-time-capsule-beat-earths-geology-and-deep-time/",
            "category": "Sci & Tech",
            "date": "2025-11-17T13:00:00Z"
        },
        {
            "title": "Ukraine to buy 100 fighter jets from France in bid to create \"one of the greatest\" air defences in the world",
            "summary": "Ukrainian President Zelenskyy has signed a letter of intent with France for 100 Rafale fighter jets. This significant agreement aims to substantially bolster Ukraine's long-term air defence capacity amidst ongoing tensions with Russia. For SSB aspirants, this highlights Ukraine's strategic efforts to modernize its military and enhance national security through international defence procurements, showcasing critical geopolitical developments.",
            "url": "https://news.sky.com/story/zelenskyy-to-buy-100-fighter-jets-from-france-in-bid-to-create-one-of-the-greatest-air-defences-in-the-world-13471659",
            "category": "Defence",
            "date": "2025-11-17T12:51:00Z"
        },
        {
            "title": "Midland Signs Definitive Agreement With Barrick for the Lewis Gold Property",
            "summary": "Midland Exploration Inc., a Montreal-based company, has announced a definitive option agreement. This strategic move involves a partnership with an undisclosed wholly-owned subsidiary, signaling future exploration activities and potential resource development. While specific details remain limited, this agreement represents a significant corporate step for Midland Exploration Inc. in advancing its resource exploration initiatives.",
            "url": "https://financialpost.com/globe-newswire/midland-signs-definitive-agreement-with-barrick-for-the-lewis-gold-property",
            "category": "Sci & Tech",
            "date": "2025-11-17T12:34:32Z"
        },
        {
            "title": "Midland Signs Definitive Agreement With Barrick for the Lewis Gold Property",
            "summary": "Midland Exploration Inc., a Canadian company based in Montreal, announced the signing of a definitive option agreement with a wholly-owned indirect subsidiary. While specific details are undisclosed due to the truncated article, this typically signifies a strategic move in resource exploration, likely involving property acquisition or exploration rights. The announcement reflects ongoing business development for the company.",
            "url": "https://www.globenewswire.com/news-release/2025/11/17/3189012/0/en/Midland-Signs-Definitive-Agreement-With-Barrick-for-the-Lewis-Gold-Property.html",
            "category": "National",
            "date": "2025-11-17T12:30:00Z"
        },
        {
            "title": "Rudra brigade revolution: How this new formation could transform the way Indian Army fights its enemies",
            "summary": "India's military doctrine is evolving, signaled by the successful testing of the newly formed 'Rudra' all-arms integrated brigade. This development indicates a strategic shift in how the nation prepares for future conflicts, emphasizing greater integration and multi-domain capabilities. This initiative aims to modernize military operations, enhancing defence preparedness and operational effectiveness against emerging threats.",
            "url": "https://economictimes.indiatimes.com/news/defence/rudra-brigade-revolution-how-this-new-formation-could-transform-the-way-the-indian-army-fights-its-enemies/articleshow/125385300.cms",
            "category": "Defence",
            "date": "2025-11-17T12:14:06Z"
        },
        {
            "title": "Karnataka to unveil IT, startup, space policies at Bengaluru Tech Summit 2025",
            "summary": "The Karnataka government is set to unveil three new policies—IT, Startup, and Space Technology—at the Bengaluru Tech Summit 2025. This move aims to strengthen the state's position as a premier technology hub, fostering innovation, attracting investment, and driving economic growth in critical tech sectors. The policies are expected to significantly contribute to India's technological advancement and competitiveness.",
            "url": "https://economictimes.indiatimes.com/news/india/karnataka-to-unveil-it-startup-space-policies-at-bengaluru-tech-summit-2025/articleshow/125385180.cms",
            "category": "Sci & Tech",
            "date": "2025-11-17T12:01:05Z"
        },
        {
            "title": "Monday Bird Droppings: What free agents should be targeted?",
            "summary": "The article reports on the ongoing offseason for the Orioles baseball team, detailing fan anticipation for significant player transactions rather than mere coaching changes. It notes the team's current standing, suggesting they haven't fallen behind in their preparations. This highlights the waiting period dynamics in professional sports leagues.",
            "url": "https://www.camdenchat.com/orioles-news-links/62675/orioles-news-free-agents",
            "category": "National",
            "date": "2025-11-17T12:00:00Z"
        },
        {
            "title": "Links 11/17/2025",
            "summary": "Pennsylvania serves as a warm winter sanctuary for smart, social crows, according to the Allegheny Front. This highlights the adaptability of these intelligent birds and the suitable environmental conditions available, potentially indicating successful avian ecology in the region. Such observations contribute to understanding wildlife habitat needs and behaviors.",
            "url": "https://www.nakedcapitalism.com/2025/11/links-11-17-2025.html",
            "category": "Sci & Tech",
            "date": "2025-11-17T11:55:27Z"
        },
        {
            "title": "Ukrainian major urges US to send Tomahawks as clashes with Russian forces intensify",
            "summary": "Intense fighting persists between Russian and Ukrainian troops on the eastern frontline across Donetsk, Kharkiv, and Zaporizhzhia regions. A senior Ukrainian commander is reportedly involved in these critical engagements. This ongoing conflict underscores significant geopolitical tensions and the complex operational realities of modern warfare, which are vital considerations for understanding global security dynamics for SSB aspirants.",
            "url": "https://www.foxnews.com/world/ukrainian-major-urges-us-send-tomahawks-clashes-russian-forces-intensify",
            "category": "Defence",
            "date": "2025-11-17T11:54:05Z"
        },
        {
            "title": "Ukraine sets its sights on 100 Rafale jets in landmark deal with France",
            "summary": "Ukrainian President Zelenskyy, on his ninth visit to France since the 2022 Russian invasion, signed a letter of intent with President Macron in Paris. This agreement likely pertains to critical defence purchases, strengthening Ukraine's capabilities amidst the ongoing conflict. The frequent high-level visits underscore France's continued support and Ukraine's urgent need for military aid.",
            "url": "https://www.euractiv.com/news/ukraine-sets-its-sights-on-100-rafale-jets-in-landmark-deal-with-france/",
            "category": "Defence",
            "date": "2025-11-17T11:51:14Z"
        },
        {
            "title": "Romanian village evacuated after Russian drone attack in south Ukraine",
            "summary": "Romanian authorities evacuated a village near the Ukrainian border following a Russian drone attack in southern Ukraine. The attack ignited a ship carrying liquefied petroleum gas, causing an immediate risk. This incident highlights the ongoing spillover dangers of the Ukraine conflict for neighboring NATO countries, prompting precautionary measures for civilian safety.",
            "url": "https://www.euractiv.com/news/romanian-village-evacuated-after-russian-drone-attack-in-south-ukraine/",
            "category": "International",
            "date": "2025-11-17T11:48:30Z"
        },
        {
            "title": "Punjab and Haryana High Court disposes of Ahir plea against Farhan Akhtar starrer ‘120 Bahadur’",
            "summary": "The Punjab and Haryana High Court swiftly disposed of a Public Interest Litigation (PIL) challenging an unspecified certification. This resolution Monday followed significant pressure from the Ahir community, highlighting a courtroom decision influenced by community advocacy. The court's action brings closure to a matter of importance for the Ahir community, demonstrating the judiciary's responsiveness to public concerns.",
            "url": "https://indianexpress.com/article/legal-news/ahir-plea-farhan-akhtar-120-bahadur-punjab-haryana-hc-10370772/",
            "category": "National",
            "date": "2025-11-17T11:38:42Z"
        },
        {
            "title": "This Week In Running: November 17, 2025",
            "summary": "Following a light weekend of racing, a brief pause precedes an anticipated end-of-year push, offering a moment to recuperate. Attention now shifts to planning for upcoming competitive events scheduled for next weekend, as participants prepare for future challenges.",
            "url": "https://www.irunfar.com/this-week-in-running-november-17-2025#article",
            "category": "National",
            "date": "2025-11-17T11:00:19Z"
        },
        {
            "title": "Giving C a Superpower",
            "summary": "This article details a method for writing robust C23 applications using a custom header file, `safe_c.h`. It demonstrates how to develop leak-free and thread-safe programs, exemplified by a secure 'grep' utility, preventing common programming errors. This guide provides C developers with practical insights and tools to significantly enhance code reliability and safety, fostering more stable and efficient software development.",
            "url": "https://hwisnu.bearblog.dev/giving-c-a-superpower-custom-header-file-safe_ch/",
            "category": "Sci & Tech",
            "date": "2025-11-17T10:40:55Z"
        },
        {
            "title": "Boost to warfighting readiness as Britain’s aircraft carrier fully ‘mission ready’ and committed to NATO for the first time",
            "summary": "The UK's HMS Prince of Wales, an aircraft carrier equipped with advanced 5th generation F-35 fighter jets, is now committed to NATO operations. This significantly enhances the alliance's air power and collective security. Simultaneously, UK Defence and Foreign Secretaries are meeting Italian counterparts, reinforcing Anglo-Italian defence cooperation and broader strategic partnerships within NATO.",
            "url": "https://www.gov.uk/government/news/boost-to-warfighting-readiness-as-britains-aircraft-carrier-fully-mission-ready-and-committed-to-nato-for-the-first-time",
            "category": "Defence",
            "date": "2025-11-17T10:29:21Z"
        },
        {
            "title": "Boost to warfighting readiness as Britain’s aircraft carrier fully ‘mission ready’ and committed to NATO for the first time",
            "summary": "The UK's HMS Prince of Wales, its first aircraft carrier equipped with advanced 5th-generation F-35 fighter jets, has been committed to NATO operations. This enhances allied naval capabilities. Concurrently, UK Defence and Foreign Secretaries are meeting Italian counterparts to reinforce bilateral defence cooperation and strategic alliances, underscoring multinational military coordination within NATO.",
            "url": "https://www.gov.uk/government/news/deleted-boost-to-warfighting-readiness-as-britains-aircraft-carrier-fully-mission-ready-and-committed-to-nato-for-the-first-time",
            "category": "Defence",
            "date": "2025-11-17T10:29:21Z"
        },
        {
            "title": "AgustaWestland case: Delhi HC declines to hear Christian Michel’s plea on India-UAE extradition treaty provision",
            "summary": "Christian Michel James, alleged middleman in the AgustaWestland VVIP chopper scam, withdrew his plea challenging a provision of the India-UAE extradition treaty from the Delhi High Court. This development concerns a major defence procurement corruption case, emphasizing India's legal pursuit of financial offenders and the complexity of international legal cooperation in upholding accountability within defence deals.",
            "url": "https://indianexpress.com/article/legal-news/agustawestland-case-delhi-hc-india-uae-extradition-treaty-provision-10370616/",
            "category": "Defence",
            "date": "2025-11-17T10:29:06Z"
        },
        {
            "title": "The Kamini Kaushal You Didn't Know",
            "summary": "Veteran Indian actress Kamini Kaushal passed away at 98, just two years shy of becoming a centenarian. Her remarkably long, rich, and creatively fulfilling life was noted for its extensive experiences and accomplishments, leaving little unfulfilled. She leaves behind a significant legacy in Indian cinema and culture, marking the end of an illustrious era.",
            "url": "https://www.rediff.com/movies/special/the-kamini-kaushal-you-didnt-know/20251117.htm",
            "category": "National",
            "date": "2025-11-17T10:19:34Z"
        }
    ]
}