{
    "last_updated": "2025-11-22T18:20:29.400582+00:00",
    "articles": [
        {
            "title": "Seconds into low-level roll, Tejas crashes at Dubai show; pilot killed",
            "summary": "An indigenous Indian Tejas fighter jet tragically crashed during a low-level aerobatics display at the Dubai air show on Friday. The sole pilot onboard did not survive the incident. This unfortunate event occurred while the aircraft was showcasing India's defence capabilities on an international platform, underscoring the inherent dangers involved in high-performance military aviation demonstrations.",
            "url": "https://economictimes.indiatimes.com/news/defence/seconds-into-low-level-roll-tejas-crashes-at-dubai-show-pilot-killed/articleshow/125492698.cms",
            "category": "Defence",
            "date": "2025-11-21T18:17:12Z"
        },
        {
            "title": "Tejas gear disrupting network in Rajasthan, alleges Bharti Airtel",
            "summary": "Telecom giant Bharti Airtel has lodged a complaint against Tata-owned Tejas Networks, alleging that its \"sub-standard equipment\" is causing significant network interference in Airtel's Rajasthan circle. This highlights crucial concerns regarding the quality of domestically manufactured telecom infrastructure and its potential impact on national network reliability and service quality for millions of users across the country.",
            "url": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/tejas-gear-disrupting-network-in-rajasthan-alleges-bharti-airtel/articleshow/125492483.cms",
            "category": "National",
            "date": "2025-11-21T18:10:22Z"
        },
        {
            "title": "HBO’s LANTERNS Premiere Bumped to Summer 2026",
            "summary": "Major entertainment franchises, including Marvel Cinematic Universe (MCU) series on Disney+ and DC Universe (DCU) projects, are experiencing significant shifts in their scheduled premieres. This development indicates ongoing adjustments to release timetables for highly anticipated content within these popular cinematic universes. The situation suggests potential challenges in production or strategic planning affecting major studios.",
            "url": "https://nerdist.com/article/hbo-moves-dc-lanterns-to-summer-2026-james-gunn-dcu/",
            "category": "International",
            "date": "2025-11-21T17:50:19Z"
        },
        {
            "title": "What are Russian forces doing in Mali amid jihadist blocade?",
            "summary": "Russian forces, likely from the Wagner Group, are actively fighting in Mali. This follows France's military withdrawal in 2022, an event celebrated by pro-Wagner rallies. This development signifies a major geopolitical shift, highlighting Russia's increasing influence in the Sahel region and a change in Mali's security partnerships as external military actors fill the void left by French forces.",
            "url": "https://www.digitaljournal.com/world/what-are-russian-forces-doing-in-mali-amid-jihadist-blocade/article",
            "category": "International",
            "date": "2025-11-21T17:37:32Z"
        },
        {
            "title": "Govt unveils tougher car safety test norms under BNCAP 2.0",
            "summary": "India's government has unveiled BNCAP 2.0, introducing tougher car safety test norms. This initiative aims to enhance vehicle safety standards across the country, ensuring greater protection for occupants and road users. It signifies a significant move towards more stringent regulations in the automotive sector, prioritizing public safety.",
            "url": "https://timesofindia.indiatimes.com/india/govt-unveils-tougher-car-safety-test-norms-under-bncap-2-0/articleshow/125491420.cms",
            "category": "National",
            "date": "2025-11-21T17:22:13Z"
        },
        {
            "title": "“People know where I stand on EVERYTHING”: xQc fires back at Pokimane’s take on modern streaming as creators clash over drama-driven content",
            "summary": "Prominent US streamers xQc and Pokimane are currently engaged in a public disagreement concerning modern streaming practices. Reports indicate that xQc has 'fired back' at Pokimane's perspective, signaling a broader clash among content creators. This conflict appears centered on industry drama and the evolving nature of content generation strategies within the global streaming community, highlighting ongoing debates among online personalities.",
            "url": "https://timesofindia.indiatimes.com/world/us-streamers/people-know-where-i-stand-on-everything-xqc-fires-back-at-pokimanes-take-on-modern-streaming-as-creators-clash-over-drama-driven-content/articleshow/125490846.cms",
            "category": "International",
            "date": "2025-11-21T17:17:51Z"
        },
        {
            "title": "Benedict Cumberbatch, Sophie Hunter Enjoy Marvelously Rare Date Night",
            "summary": "Internationally renowned actor Benedict Cumberbatch and his wife Sophie Hunter, parents to Christopher (10), Hal (8), and Finn (6), made a rare public appearance together. The couple attended a screening in New York City on November 19th, drawing attention for their joint outing and the event related to Benedict's ongoing professional work.",
            "url": "https://www.eonline.com/news/1425363/benedict-cumberbatch-sophie-hunter-rare-appearance",
            "category": "International",
            "date": "2025-11-21T17:13:37Z"
        },
        {
            "title": "IAF’s Tejas fighter jet crashes during Dubai Air Show, pilot dies; CoI ordered",
            "summary": "An Indian Air Force Tejas fighter jet crashed during an aerial display on Friday, tragically killing its pilot. The indigenous Light Combat Aircraft (LCA) went down in a ball of fire. This incident raises questions about operational safety and the performance of India's domestically developed defence platforms, a key area for aspiring defence personnel.",
            "url": "https://statetimes.in/iafs-tejas-fighter-jet-crashes-during-dubai-air-show-pilot-dies-coi-ordered/",
            "category": "Defence",
            "date": "2025-11-21T16:48:32Z"
        },
        {
            "title": "HII Delivers Virginia-Class Submarine Massachusetts (SSN 798) to U.S. Navy",
            "summary": "HII's Newport News Shipbuilding delivered the Virginia-class fast-attack submarine USS Massachusetts (SSN-798) to the U.S. Navy. This induction significantly bolsters America's naval power with a modern, stealthy underwater asset. It highlights continuous advancements in defence manufacturing and strategic capabilities, crucial for maritime security and power projection in complex global scenarios.",
            "url": "https://www.globenewswire.com/news-release/2025/11/21/3192905/14858/en/HII-Delivers-Virginia-Class-Submarine-Massachusetts-SSN-798-to-U-S-Navy.html",
            "category": "Defence",
            "date": "2025-11-21T16:45:00Z"
        },
        {
            "title": "Deeply anguished over loss of brave, courageous IAF pilot in Dubai Air Show: Rajnath Singh",
            "summary": "Defence Minister Rajnath Singh expressed profound anguish over the loss of an IAF pilot in a fighter jet crash during an aerial display at the Dubai Air Show. The incident tragically claimed the life of a brave Indian Air Force pilot. The Minister conveyed heartfelt condolences, acknowledging the immense sacrifices and inherent dangers faced by service personnel in their line of duty, even during demonstrations.",
            "url": "https://economictimes.indiatimes.com/news/defence/deeply-anguished-over-loss-of-brave-courageous-iaf-pilot-in-dubai-air-show-rajnath-singh/articleshow/125490739.cms",
            "category": "Defence",
            "date": "2025-11-21T16:38:50Z"
        },
        {
            "title": "Tejas Crash: HAL Condoles Death Of IAF Pilot Naman Syal In Dubai Air Show Disaster",
            "summary": "Hindustan Aeronautics Ltd. (HAL) condoled the death of an Indian Air Force pilot killed in a tragic Tejas fighter jet accident during an aerial display at the Dubai Air Show on Friday. This incident highlights the significant risks involved in military aviation and the inherent dangers associated with high-performance aircraft operations, reminding aspiring officers of the bravery and commitment integral to serving the nation.",
            "url": "https://www.ndtvprofit.com/nation/tejas-crash-hal-condoles-death-of-iaf-pilot-naman-syal-in-dubai-air-show-disaster",
            "category": "Defence",
            "date": "2025-11-21T16:37:57Z"
        },
        {
            "title": "Zelenskiy vows not to betray Ukraine after US presents plan demanding concessions",
            "summary": "Ukrainian President Zelenskiy has vowed not to \"betray\" Ukraine, following reports that the United States presented a plan demanding concessions from Kyiv. This stance underscores Ukraine's determination amidst international pressure and complex geopolitical negotiations. The situation highlights ongoing challenges to Ukraine's sovereignty and its leaders' commitment to national interests, shaping future diplomatic efforts and strategic alliances.",
            "url": "https://freerepublic.com/focus/f-news/4353839/posts",
            "category": "International",
            "date": "2025-11-21T16:30:04Z"
        }
    ]
}