{
    "last_updated": "2025-11-18T19:50:42.667829+00:00",
    "articles": [
        {
            "title": "Chandrayaan-4 mission likely to be launched in 2028, says Isro chief",
            "summary": "ISRO chief announced India's ambitious Chandrayaan-4 lunar sample-return mission is likely to launch in 2028. This complex project aims to retrieve lunar samples, marking a significant advancement in India's space exploration capabilities. Such missions demonstrate India's growing scientific prowess and contribute to global space research, highlighting national progress.",
            "url": "https://timesofindia.indiatimes.com/india/chandrayaan-4-mission-likely-to-be-launched-in-2028-says-isro-chief/articleshow/125393792.cms",
            "category": "Sci & Tech",
            "date": "2025-11-17T19:04:44Z"
        },
        {
            "title": "The scary implications of the world’s first AI-orchestrated cyberattack",
            "summary": "A nuclear-armed intercontinental ballistic missile (ICBM) launched from Russia would take approximately 30 minutes to reach the United States. Submarine-launched missiles could drastically cut this travel time, emphasizing the extremely narrow window for detection and response in potential nuclear conflicts. This highlights the critical importance of early warning systems and strategic defence preparedness for both global powers.",
            "url": "https://biztoc.com/x/7ccb6c845d9cf94b",
            "category": "Defence",
            "date": "2025-11-17T18:32:35Z"
        },
        {
            "title": "Fantasy Basketball Week 5 Start/Sit Lineup Decisions: Kris Dunn may be a sneaky gamble with upside",
            "summary": "The NBA is gearing up for another busy week with a packed basketball schedule. Notably, the New Orleans Pelicans have made a significant coaching change, moving on from Willie Green. James Borrego has been promoted to the interim head coach, signifying a shift in team leadership and strategy within this prominent national sports league.",
            "url": "https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-week-5-startsit-lineup-decisions-kris-dunn-may-be-a-sneaky-gamble-with-upside/",
            "category": "National",
            "date": "2025-11-17T18:30:09Z"
        },
        {
            "title": "The scary implications of the world’s first AI-orchestrated cyberattack",
            "summary": "A nuclear-armed intercontinental ballistic missile (ICBM) launched from Russia would take approximately 30 minutes to reach the United States. Submarine-launched missiles could arrive even faster, significantly reducing response times. This scenario underscores the critical importance of robust early warning systems, strategic defence planning, and international diplomatic efforts to maintain global stability and prevent such high-speed nuclear threats from escalating.",
            "url": "https://www.vox.com/politics/468720/nuclear-ai-command-control",
            "category": "Defence",
            "date": "2025-11-17T18:23:51Z"
        },
        {
            "title": "Introducing F# 10",
            "summary": "F# 10 has been released, shipping alongside .NET 10 and Visual Studio 2026. This new version is primarily a refinement release, heavily focused on enhancing clarity, consistency, and overall performance. It introduces numerous small but meaningful improvements designed to streamline the development experience and boost efficiency for programmers using the F# language.",
            "url": "https://devblogs.microsoft.com/dotnet/introducing-fsharp-10/",
            "category": "Sci & Tech",
            "date": "2025-11-17T18:05:00Z"
        },
        {
            "title": "Ringo Starr announces spring 2026 tour. Get tickets today",
            "summary": "The provided text is a standard disclaimer from the New York Post, disclosing its official ticketing partnership with Vivid Seats. It clarifies that the Post may earn revenue from sharing content or purchases made through this collaboration. This snippet solely serves as a transparency statement regarding potential affiliate earnings, rather than presenting any actual news content or specific events relevant for general awareness.",
            "url": "https://nypost.com/2025/11/17/ticket-sales/ringo-starr-tour-2026-where-to-buy-tickets-schedule-dates/",
            "category": "National",
            "date": "2025-11-17T18:03:32Z"
        },
        {
            "title": "Inside billionaire Gabe Newell’s new $500 million superyacht, which has a submarine garage and its own hospital",
            "summary": "Gabe Newell's company, Valve, well-known for its Steam PC gaming platform, recently unveiled three new hardware products. This announcement marks a significant expansion for Valve beyond its traditional software distribution model. It highlights ongoing advancements in the tech industry towards integrated gaming ecosystems and hardware innovation, a key area for aspirants to track for understanding global technological progress and market trends.",
            "url": "https://biztoc.com/x/c7b967b335c7477d",
            "category": "Sci & Tech",
            "date": "2025-11-17T17:36:24Z"
        },
        {
            "title": "Pierce Brosnan says he's heard his Black Adam character is \"going to have his own show, or his own movie\" and is \"going to be in the next Superman\"",
            "summary": "Pierce Brosnan, who debuted in 2022's 'Black Adam', might return to comic book movies. Despite earlier uncertainties regarding the DCEU's future under new leadership, including James Gunn and Peter Safran, the possibility of Brosnan's continued involvement in the genre remains open. This suggests potential shifts in Hollywood's comic book movie landscape.",
            "url": "https://www.gamesradar.com/entertainment/dc-movies/pierce-brosnan-says-hes-heard-his-black-adam-character-is-going-to-have-his-own-show-or-his-own-movie-and-is-going-to-be-in-the-next-superman/",
            "category": "International",
            "date": "2025-11-17T17:27:17Z"
        },
        {
            "title": "Inside billionaire Gabe Newell’s new $500 million superyacht, which has a submarine garage and its own hospital",
            "summary": "Gabe Newell, co-founder of Valve, has acquired Oceanco, a Dutch luxury yacht builder. Newell purchased the shipyard, which previously constructed his yacht \"Leviathan,\" for an undisclosed sum in August. This significant cross-border transaction expands the tech mogul's investments into high-end maritime manufacturing, marking a notable business development.",
            "url": "https://fortune.com/2025/11/17/gabe-newell-leviathan-superyacht-features-submarine-garage-hospital-spa-gaming-pcs-inkfish-oceanco/",
            "category": "International",
            "date": "2025-11-17T17:19:40Z"
        },
        {
            "title": "Betty Gilpin Joins Ron Howard’s Amazon MGM Military Drama ‘Alone At Dawn’",
            "summary": "Actress Betty Gilpin is set to star alongside Adam Driver and Anne Hathaway in Ron Howard's upcoming Amazon MGM military drama, 'Alone at Dawn'. Based on a 2019 book, this film promises a deep dive into military narratives. For SSB aspirants, it offers an interesting perspective on defence-related themes through an entertainment medium, potentially inspiring discussions on military life and experiences.",
            "url": "http://deadline.com/2025/11/alone-at-dawn-casts-betty-gilpin-amazon-mgm-1236620312/",
            "category": "Defence",
            "date": "2025-11-17T17:15:55Z"
        },
        {
            "title": "DA Alvin Bragg Releases Migrant Taxi Driver Charged for Repeatedly Assaulting Female Passengers",
            "summary": "District Attorney Alvin Bragg has reportedly released a migrant taxi driver who was charged with repeatedly assaulting female passengers. This decision has ignited public debate concerning the justice system's approach to serious allegations and its impact on public safety. The incident draws attention to the complexities surrounding migrant crime, accountability, and the responsibilities of judicial authorities in handling such cases.",
            "url": "https://freerepublic.com/focus/f-news/4353009/posts",
            "category": "National",
            "date": "2025-11-17T17:15:26Z"
        }
    ]
}