{
    "last_updated": "2025-11-22T12:27:40.165085+00:00",
    "articles": [
        {
            "title": "Dyson just released mopping versions of its best vacuums – and they're already discounted in the Black Friday sales",
            "summary": "Dyson has launched new 'Submarine' versions of its V12, V10, and V15 vacuum cleaners, integrating an innovative mopping floorhead for combined dry and wet cleaning. These models offer enhanced home cleaning convenience by vacuuming and mopping simultaneously. The launch includes significant discounts, making advanced Dyson technology more accessible to consumers. This showcases ongoing innovation in domestic appliance technology and user-centric design.",
            "url": "https://www.techradar.com/home/vacuums/dyson-just-released-mopping-versions-of-its-best-vacuums-and-theyre-already-discounted-in-the-black-friday-sales",
            "category": "Sci & Tech",
            "date": "2025-11-21T12:27:37Z"
        },
        {
            "title": "Pilot killed as Indian fighter jet crashes at Dubai Air Show (VIDEO)",
            "summary": "An Indian Air Force (IAF) Tejas fighter jet tragically crashed during a demonstration at the Dubai Airshow, resulting in the death of the pilot. The IAF confirmed the incident. This unfortunate event underscores the inherent risks in military aviation and the profound sacrifices made by service personnel while representing the nation on international platforms.",
            "url": "https://www.rt.com/india/628102-ias-pilot-dead-dubai-crash/",
            "category": "Defence",
            "date": "2025-11-21T12:27:32Z"
        },
        {
            "title": "Indian fighter jet crashes at Dubai airshow, pilot killed",
            "summary": "An Indian fighter jet crashed during a flying display at the Dubai Airshow on Friday, resulting in the pilot's tragic death. The warplane was performing a low roll when it crashed in flames, as confirmed by a government statement. This incident at an international defence exhibition underscores the inherent risks associated with military aviation demonstrations and aerial manoeuvres.",
            "url": "https://punchng.com/indian-fighter-jet-crashes-at-dubai-airshow-pilot-killed/",
            "category": "Defence",
            "date": "2025-11-21T12:15:56Z"
        },
        {
            "title": "India’s Tejas fighter crashed during test flight in Dubai",
            "summary": "An Indian Air Force (IAF) Tejas fighter jet crashed during a test flight at the Dubai Airshow. The IAF confirmed the incident involving India's indigenous Light Combat Aircraft, which was being showcased internationally. This event is crucial for SSB aspirants, highlighting aspects of defence technology, operational challenges, and India's global standing in aerospace.",
            "url": "https://mypeoplesreview.com/2025/11/21/indias-tejas-fighter-crashed-during-test-flight-in-dubai/",
            "category": "Defence",
            "date": "2025-11-21T12:13:18Z"
        },
        {
            "title": "Tejas crashes at Dubai Airshow: A list of all IAF aircraft accidents in 2025",
            "summary": "The year 2025 has been marked by a concerning series of accidents involving defence aircraft, both during training and operational flights. Crashes have been reported across various fleets, including Pilatus trainer aircraft, Mirage 2000 fighter jets, and multiple Jaguar jets. This pattern of repeated incidents raises significant questions about aviation safety and maintenance within the defence sector.",
            "url": "https://economictimes.indiatimes.com/news/defence/tejas-crashes-at-dubai-airshow-a-list-of-all-iaf-aircraft-accidents-in-2025/articleshow/125485346.cms",
            "category": "Defence",
            "date": "2025-11-21T12:08:04Z"
        },
        {
            "title": "Nintendo, cover your eyes: Kirby Air Riders players fight back as micro bikini vehicle gets removed from the Switch 2 racer, immediately replacing it with a newer, sexier version",
            "summary": "A controversial, fan-created 'scantily clad Chef Kawasaki vehicle' from 'Kirby Air Riders,' previously deleted, has unexpectedly reappeared, described as 'sexier than ever.' This incident highlights the persistent and sometimes unusual creativity within online gaming fan communities and their expressions in digital culture.",
            "url": "https://www.gamesradar.com/games/kirby/nintendo-cover-your-eyes-kirby-air-riders-players-fight-back-as-micro-bikini-vehicle-gets-removed-from-the-switch-2-racer-immediately-replacing-it-with-a-newer-sexier-version/",
            "category": "Sci & Tech",
            "date": "2025-11-21T12:06:08Z"
        },
        {
            "title": "Indian fighter jet crashes at Dubai Air Show, pilot killed",
            "summary": "An Indian Air Force pilot was tragically killed when his indigenous HAL Tejas aircraft crashed during a demonstration at the Dubai Air Show on Friday. The incident occurred after the combat plane had flown multiple passes. This unfortunate event involving India's Light Combat Aircraft underscores the critical importance of stringent flight safety protocols and risk assessment in defence aviation and public displays.",
            "url": "https://www.israelnationalnews.com/news/418146",
            "category": "Defence",
            "date": "2025-11-21T12:04:11Z"
        },
        {
            "title": "France reduces diplomatic staff in Mali over insecurity — Ministry",
            "summary": "France is significantly reducing its diplomatic presence in Mali due to the severely deteriorating security situation in the West African nation. A major contributing factor is a jihadist-imposed fuel blockade, exacerbating instability. This move reflects growing concerns over safety for foreign personnel amidst the ongoing crisis, highlighting regional challenges.",
            "url": "https://punchng.com/?p=1990583",
            "category": "International",
            "date": "2025-11-21T12:00:55Z"
        },
        {
            "title": "Tejas fighter jet crashes at Dubai Air Show: All about India's home-built fighter aircraft",
            "summary": "An Indian Air Force Tejas fighter jet tragically crashed during the Dubai Air Show on Friday. The incident resulted in fatal injuries to the pilot, as confirmed by the IAF. The indigenous aircraft went down around 2:15 pm. This unfortunate event highlights the inherent risks in military aviation and international showcases.",
            "url": "https://economictimes.indiatimes.com/news/defence/tejas-fighter-jet-crashes-at-dubai-air-show-all-about-indias-home-built-fighter-aircraft/articleshow/125485173.cms",
            "category": "Defence",
            "date": "2025-11-21T11:57:59Z"
        },
        {
            "title": "IAF LCA Tejas Crashes at Dubai Air Show, Pilot Killed",
            "summary": "An Indian Air Force (IAF) LCA Tejas fighter jet crashed on November 21, 2025, around 2 pm local time, while performing a low-altitude vertical maneuver at the ongoing Dubai Air Show. Eyewitness accounts and video footage confirm the incident. This unfortunate event involving India's indigenous fighter at an international exhibition highlights the inherent risks of aerial displays and will likely prompt an investigation into flight safety protocols.",
            "url": "https://theaviationist.com/2025/11/21/iaf-lca-tejas-crash-dubai-air-show/",
            "category": "Defence",
            "date": "2025-11-21T11:57:52Z"
        },
        {
            "title": "Indian combat aircraft crashes during a demonstration at Dubai Air Show, killing the pilot",
            "summary": "An Indian Air Force combat plane crashed during a demonstration flight at the Dubai Air Show on Friday, resulting in the death of the pilot. The IAF confirmed the incident, highlighting the inherent risks in showcasing advanced aviation capabilities on an international platform like the Dubai Air Show, a significant event for global defence collaboration and strategic partnerships.",
            "url": "https://abcnews.go.com/Business/wireStory/indian-combat-aircraft-crashes-demonstration-dubai-air-show-127741091",
            "category": "Defence",
            "date": "2025-11-21T11:57:40Z"
        },
        {
            "title": "Suspension of the United States From the United Nations: Procedure, Limits and Feasibility",
            "summary": "The provided article text introduces Dr. Atul Alexander, an Assistant Professor, and Vadita Agarwal, a final year law student, both from the West Bengal National University of Juridical Sciences. The actual subject matter and content of their written piece are missing from the provided text, preventing a detailed summary of its topic or arguments.",
            "url": "http://opiniojuris.org/2025/11/21/suspension-of-the-united-states-from-the-united-nations-procedure-limits-and-feasibility/",
            "category": "National",
            "date": "2025-11-21T11:55:39Z"
        },
        {
            "title": "Tejas crash reason: When engine seizure caused the Made in India fighter jet to crash for the first time",
            "summary": "An Indian Air Force Tejas fighter jet tragically crashed during a performance at the Dubai Air Show, resulting in the death of its pilot. This unfortunate incident underscores the inherent risks associated with high-performance military aviation demonstrations and the significant sacrifices made by our defence personnel while representing national capabilities on an international stage.",
            "url": "https://economictimes.indiatimes.com/news/defence/tejas-crash-reason-when-engine-seizure-caused-the-made-in-india-fighter-jet-to-crash-for-the-first-time/articleshow/125485734.cms",
            "category": "Defence",
            "date": "2025-11-21T11:51:19Z"
        },
        {
            "title": "Tejas fighter jet crashes at Dubai Air Show",
            "summary": "An Indian HAL Tejas fighter jet crashed during a demonstration at the Dubai Air Show on Friday around 2:10 p.m. local time. The domestically developed light combat aircraft was performing when the incident occurred. Initial reports lacked immediate clarity on whether the pilot had successfully ejected, raising safety concerns for the ongoing airshow and impacting the perception of India's indigenous defence capabilities showcased internationally.",
            "url": "https://economictimes.indiatimes.com/news/defence/tejas-fighter-jet-crashes-at-dubai-air-show/articleshow/125483917.cms",
            "category": "Defence",
            "date": "2025-11-21T10:36:57Z"
        },
        {
            "title": "Plane crashes during a demonstration at the Dubai Air Show",
            "summary": "An Indian HAL Tejas combat aircraft crashed during a demonstration at the Dubai Air Show on Friday. The indigenous aircraft, a key component of the Indian Air Force, experienced an incident while performing. This event at an international forum highlights the challenges and risks associated with advanced military aviation displays, offering a crucial learning point for aspiring defence personnel regarding operational safety and technological showcase.",
            "url": "https://apnews.com/article/dubai-air-show-plane-crash-9df3d47f6220c7772a1d24762b0e2836",
            "category": "Defence",
            "date": "2025-11-21T10:31:23Z"
        },
        {
            "title": "tinyworkflow added to PyPI",
            "summary": "TinyWorkflow is a new Python-first library developed for simplifying workflow concepts, prototyping, and lightweight task orchestration. Designed for learning and experimentation, it makes complex processes manageable for developers. This tool aids in understanding software engineering principles by providing a practical framework for automating sequential or parallel tasks efficiently, crucial for project management in technology fields.",
            "url": "https://pypi.org/project/tinyworkflow/",
            "category": "Sci & Tech",
            "date": "2025-11-21T10:20:24Z"
        },
        {
            "title": "Romania scrambles jets over fresh drone incursion; German military to counter drones domestically",
            "summary": "NATO member Romania, bordering Ukraine, scrambled fighter jets early Wednesday after a fresh drone incursion, confirmed by its defence ministry. This incident highlights persistent security challenges and potential spillover effects from the conflict in neighboring Ukraine into NATO airspace, demonstrating evolving regional security dynamics relevant for SSB aspirants.",
            "url": "https://www.spacewar.com/reports/Romania_scrambles_jets_over_fresh_drone_incursion_999.html",
            "category": "Defence",
            "date": "2025-11-21T09:30:15Z"
        },
        {
            "title": "Taiwan president lunches on sushi in support of Japan; Taiwan charges 7 with spying",
            "summary": "Taiwanese President Lai Ching-te posted images on social media showing himself eating sushi. This public demonstration was a clear show of support for Tokyo, following unspecified reports likely impacting Japan. The gesture underscores Taiwan's diplomatic solidarity with Japan, leveraging cultural engagement to reinforce bilateral relations and express international backing.",
            "url": "https://www.sinodaily.com/reports/Taiwan_president_lunches_on_sushi_in_support_of_Japan_over_China_row_999.html",
            "category": "International",
            "date": "2025-11-21T09:30:15Z"
        },
        {
            "title": "UK and MBDA announce major anti-drone laser contract",
            "summary": "The UK announced a £316 million contract with European arms manufacturer MBDA for the advanced 'DragonFire' laser weapon system. This significant investment underscores Britain's commitment to enhancing its defence capabilities with cutting-edge directed energy technology. For SSB aspirants, this highlights the strategic shift towards high-tech weaponry in modern warfare and the continuous need for advanced national security readiness.",
            "url": "https://www.spacewar.com/reports/UK_and_MBDA_announce_316mn_anti-drone_laser_contract_999.html",
            "category": "Defence",
            "date": "2025-11-21T09:30:15Z"
        },
        {
            "title": "US national in German court over China spying offer",
            "summary": "A US citizen has gone on trial in Germany, accused of offering sensitive information to China while employed by a civilian contractor. This high-profile case underscores international intelligence concerns and the complex geopolitical landscape involving major global powers. For SSB aspirants, it highlights issues of espionage, national security, and the critical importance of safeguarding sensitive data.",
            "url": "https://www.spacewar.com/reports/US_national_in_German_court_over_China_spying_offer_999.html",
            "category": "International",
            "date": "2025-11-21T09:30:15Z"
        },
        {
            "title": "Is Beijing's spat with Japan sending a message to US and allies over Taiwan?",
            "summary": "Beijing's recent strong reaction towards Japan is seen by Chinese analysts as a clear message concerning Taiwan, primarily directed at the United States and its allies. This diplomatic move aims to reinforce China's stance on the self-governed island. The incident highlights escalating geopolitical tensions and strategic signaling within the Indo-Pacific region regarding Taiwan's sovereignty and stability.",
            "url": "https://www.yahoo.com/news/articles/beijings-spat-japan-sending-message-093000337.html",
            "category": "International",
            "date": "2025-11-21T09:30:00Z"
        },
        {
            "title": "Oni Press February 2026 Full Solicits, Murder Drones & Tortured Hearts",
            "summary": "Oni Press released its February 2026 comic solicitations, featuring upcoming titles like 'Murder Drones', 'Autumn Kingdom', and 'Tortured Hearts'. The announcement previews diverse content, including 'gender queer' themes and popular culture references such as 'Rick and Morty'. This provides an early look for enthusiasts interested in the publisher's future graphic novel offerings, reflecting trends in the entertainment industry.",
            "url": "https://bleedingcool.com/comics/oni-press-february-2026-full-solicits-murder-drones-tortured-hearts/",
            "category": "International",
            "date": "2025-11-21T08:57:04Z"
        },
        {
            "title": "1 lakh rent in Bengaluru?: Techie’s house hunt sparks online outrage",
            "summary": "Bengaluru's escalating housing crisis gained national attention after tech professional Sahil Khan revealed online the immense difficulty in securing an affordable rental home. His widely discussed post underscores the significant urban housing challenges in major Indian tech hubs, where rising costs and scarcity impact even high-earning professionals, sparking broader discussions on national housing affordability and urban planning.",
            "url": "https://economictimes.indiatimes.com/news/new-updates/1-lakh-rent-in-bengaluru-techies-house-hunt-sparks-online-outrage/articleshow/125481363.cms",
            "category": "National",
            "date": "2025-11-21T08:28:01Z"
        },
        {
            "title": "PAC ends proceedings on govt vehicle management, continues sessions on e-Jamin bail system",
            "summary": "Malaysia's Public Accounts Committee (PAC) in Kuala Lumpur has concluded its proceedings concerning the management of government vehicles under concession agreements. This action by a national parliamentary oversight body underscores ongoing governmental accountability and transparency in public resource management, a critical aspect for good governance. The PAC continues to pursue other separate inquiries.",
            "url": "https://www.thestar.com.my/news/nation/2025/11/21/pac-ends-proceedings-on-govt-vehicle-management-continues-sessions-on-e-jamin-bail-system",
            "category": "International",
            "date": "2025-11-21T08:23:00Z"
        },
        {
            "title": "DRDO, DGA of France Ink Pact To Develop Innovative Solutions For Defence Challenges",
            "summary": "India's Defence Research & Development Organisation (DRDO) and France's Directorate General of Armaments (DGA) have signed a technical agreement. This collaboration aims to leverage their combined expertise, likely in defence research and development, fostering a strategic partnership between the two nations. It signifies ongoing efforts to enhance defence capabilities and strengthen bilateral cooperation in the defence sector.",
            "url": "https://www.ndtvprofit.com/global-economics/drdo-dga-of-france-ink-pact-to-develop-innovative-solutions-for-defence-challenges",
            "category": "Defence",
            "date": "2025-11-21T07:49:38Z"
        },
        {
            "title": "Plane crashes at Dubai air show",
            "summary": "An Indian Air Force HAL Tejas combat jet crashed during a demonstration flight at the Dubai Air Show around 2:10 PM local time. This incident involved India's indigenous light combat aircraft on an international stage. While specific details on the pilot's condition or cause are pending, it highlights the inherent risks of advanced aerial demonstrations and global projection of defence capabilities.",
            "url": "https://news.sky.com/story/plane-crashes-at-dubai-air-show-13473492",
            "category": "Defence",
            "date": "2025-11-21T07:25:00Z"
        }
    ]
}